codeljo/riscv-bare-metal/esp32c6/include/registers.inc
######################################################
# ESP32-C6
######################################################

######################################################
# Configuration and Status Registers (CSRs)
# (TRM 37)
######################################################
# Machine Information CSRs
.equ mvendorid, 0xF11
.equ marchid,   0xF12
.equ mimpid,    0xF13
.equ mhartid,   0xF14
# Machine Trap Setup CSRs
.equ mstatus,   0x300
.equ misa,      0x301
.equ mideleg,   0x303
.equ mie,       0x304
.equ mtvec,     0x305
# Machine Trap Handling CSRs
.equ mscratch,  0x340
.equ mepc,      0x341
.equ mcause,    0x342
.equ mtval,     0x343
.equ mip,       0x344
# User Trap Setup CSRs
.equ ustatus,   0x000
.equ uie,       0x004
.equ utvec,     0x005 
# User Trap Handling CSRs
.equ uscratch,  0x040
.equ uepc,      0x041
.equ ucause,    0x042
.equ uip,       0x044
# Physical Memory Protection (PMP) CSRs
.equ pmpcfg0,   0x3A0
.equ pmpcfg1,   0x3A1
.equ pmpcfg2,   0x3A2
.equ pmpcfg3,   0x3A3
.equ pmpaddr0,  0x3B0
.equ pmpaddr1,  0x3B1
.equ pmpaddr2,  0x3B2
.equ pmpaddr3,  0x3B3
.equ pmpaddr4,  0x3B4
.equ pmpaddr5,  0x3B5
.equ pmpaddr6,  0x3B6
.equ pmpaddr7,  0x3B7
.equ pmpaddr8,  0x3B8
.equ pmpaddr9,  0x3B9
.equ pmpaddr10, 0x3BA
.equ pmpaddr11, 0x3BB
.equ pmpaddr12, 0x3BC
.equ pmpaddr13, 0x3BD
.equ pmpaddr14, 0x3BE
.equ pmpaddr15, 0x3BF
# Trigger Module CSRs (shared with Debug Mode)
.equ tselect,   0x7A0
.equ tdata1,    0x7A1
.equ tdata2,    0x7A2
.equ tcontrol,  0x7A5
# Debug Mode CSRs
.equ dcsr,      0x7B0
.equ dpc,       0x7B1
.equ dscratch0, 0x7B2
.equ dscratch1, 0x7B3
# Performance Counter CSRs (Custom)
.equ mpcer,     0x7E0
.equ mpcmr,     0x7E1
.equ mpccr,     0x7E2
# GPIO Access CSRs (Custom)
.equ cpu_gpio_oen, 0x803
.equ cpu_gpio_in,  0x804
.equ cpu_gpio_out, 0x805
######################################################

######################################################
# GDMA Controller (GDMA)
# (TRM 134)
######################################################
.equ GDMA_BASE,                           0x60080000
# Interrupt Registers
.equ GDMA_IN_INT_RAW_CH0_REG,             0x60080000
.equ GDMA_IN_INT_ST_CH0_REG,              0x60080004
.equ GDMA_IN_INT_ENA_CH0_REG,             0x60080008
.equ GDMA_IN_INT_CLR_CH0_REG,             0x6008000C
.equ GDMA_IN_INT_RAW_CH1_REG,             0x60080010
.equ GDMA_IN_INT_ST_CH1_REG,              0x60080014
.equ GDMA_IN_INT_ENA_CH1_REG,             0x60080018
.equ GDMA_IN_INT_CLR_CH1_REG,             0x6008001C
.equ GDMA_IN_INT_RAW_CH2_REG,             0x60080020
.equ GDMA_IN_INT_ST_CH2_REG,              0x60080024
.equ GDMA_IN_INT_ENA_CH2_REG,             0x60080028
.equ GDMA_IN_INT_CLR_CH2_REG,             0x6008002C
.equ GDMA_OUT_INT_RAW_CH0_REG,            0x60080030
.equ GDMA_OUT_INT_ST_CH0_REG,             0x60080034
.equ GDMA_OUT_INT_ENA_CH0_REG,            0x60080038
.equ GDMA_OUT_INT_CLR_CH0_REG,            0x6008003C
.equ GDMA_OUT_INT_RAW_CH1_REG,            0x60080040
.equ GDMA_OUT_INT_ST_CH1_REG,             0x60080044
.equ GDMA_OUT_INT_ENA_CH1_REG,            0x60080048
.equ GDMA_OUT_INT_CLR_CH1_REG,            0x6008004C
.equ GDMA_OUT_INT_RAW_CH2_REG,            0x60080050
.equ GDMA_OUT_INT_ST_CH2_REG,             0x60080054
.equ GDMA_OUT_INT_ENA_CH2_REG,            0x60080058
.equ GDMA_OUT_INT_CLR_CH2_REG,            0x6008005C
# Debug Registers
.equ GDMA_AHB_TEST_REG,                   0x60080060
# Configuration Register
.equ GDMA_MISC_CONF_REG,                  0x60080064
.equ GDMA_IN_CONF0_CH0_REG,               0x60080070
.equ GDMA_IN_CONF1_CH0_REG,               0x60080074
.equ GDMA_IN_POP_CH0_REG,                 0x6008007C
.equ GDMA_IN_LINK_CH0_REG,                0x60080080
.equ GDMA_OUT_CONF0_CH0_REG,              0x600800D0
.equ GDMA_OUT_CONF1_CH0_REG,              0x600800D4
.equ GDMA_OUT_PUSH_CH0_REG,               0x600800DC
.equ GDMA_OUT_LINK_CH0_REG,               0x600800E0     
.equ GDMA_IN_CONF0_CH1_REG,               0x60080130
.equ GDMA_IN_CONF1_CH1_REG,               0x60080134
.equ GDMA_IN_POP_CH1_REG,                 0x6008013C
.equ GDMA_IN_LINK_CH1_REG,                0x60080140
.equ GDMA_OUT_CONF0_CH1_REG,              0x60080190
.equ GDMA_OUT_CONF1_CH1_REG,              0x60080194
.equ GDMA_OUT_PUSH_CH1_REG,               0x6008019C
.equ GDMA_OUT_LINK_CH1_REG,               0x600801A0
.equ GDMA_IN_CONF0_CH2_REG,               0x600801F0
.equ GDMA_IN_CONF1_CH2_REG,               0x600801F4
.equ GDMA_IN_POP_CH2_REG,                 0x600801FC
.equ GDMA_IN_LINK_CH2_REG,                0x60080200
.equ GDMA_OUT_CONF0_CH2_REG,              0x60080250
.equ GDMA_OUT_CONF1_CH2_REG,              0x60080254
.equ GDMA_OUT_PUSH_CH2_REG,               0x6008025C
.equ GDMA_OUT_LINK_CH2_REG,               0x60080260
# Version Register
.equ GDMA_DATE_REG,                       0x60080068
# Status Registers
.equ GDMA_INFIFO_STATUS_CH0_REG,          0x60080078
.equ GDMA_IN_STATE_CH0_REG,               0x60080084
.equ GDMA_IN_SUC_EOF_DES_ADDR_CH0_REG,    0x60080088
.equ GDMA_IN_ERR_EOF_DES_ADDR_CH0_REG,    0x6008008C
.equ GDMA_IN_DSCR_CH0_REG,                0x60080090
.equ GDMA_IN_DSCR_BF0_CH0_REG,            0x60080094
.equ GDMA_IN_DSCR_BF1_CH0_REG,            0x60080098
.equ GDMA_OUTFIFO_STATUS_CH0_REG,         0x600800D8
.equ GDMA_OUT_STATE_CH0_REG,              0x600800E4
.equ GDMA_OUT_EOF_DES_ADDR_CH0_REG,       0x600800E8
.equ GDMA_OUT_EOF_BFR_DES_ADDR_CH0_REG,   0x600800EC
.equ GDMA_OUT_DSCR_CH0_REG,               0x600800F0
.equ GDMA_OUT_DSCR_BF0_CH0_REG,           0x600800F4
.equ GDMA_OUT_DSCR_BF1_CH0_REG,           0x600800F8
.equ GDMA_INFIFO_STATUS_CH1_REG,          0x60080138
.equ GDMA_IN_STATE_CH1_REG,               0x60080144
.equ GDMA_IN_SUC_EOF_DES_ADDR_CH1_REG,    0x60080148
.equ GDMA_IN_ERR_EOF_DES_ADDR_CH1_REG,    0x6008014C
.equ GDMA_IN_DSCR_CH1_REG,                0x60080150
.equ GDMA_IN_DSCR_BF0_CH1_REG,            0x60080154
.equ GDMA_IN_DSCR_BF1_CH1_REG,            0x60080158
.equ GDMA_OUTFIFO_STATUS_CH1_REG,         0x60080198
.equ GDMA_OUT_STATE_CH1_REG,              0x600801A4
.equ GDMA_OUT_EOF_DES_ADDR_CH1_REG,       0x600801A8
.equ GDMA_OUT_EOF_BFR_DES_ADDR_CH1_REG,   0x600801AC
.equ GDMA_OUT_DSCR_CH1_REG,               0x600801B0
.equ GDMA_OUT_DSCR_BF0_CH1_REG,           0x600801B4
.equ GDMA_OUT_DSCR_BF1_CH1_REG,           0x600801B8
.equ GDMA_INFIFO_STATUS_CH2_REG,          0x600801F8
.equ GDMA_IN_STATE_CH2_REG,               0x60080204
.equ GDMA_IN_SUC_EOF_DES_ADDR_CH2_REG,    0x60080208
.equ GDMA_IN_ERR_EOF_DES_ADDR_CH2_REG,    0x6008020C
.equ GDMA_IN_DSCR_CH2_REG,                0x60080210
.equ GDMA_IN_DSCR_BF0_CH2_REG,            0x60080214
.equ GDMA_IN_DSCR_BF1_CH2_REG,            0x60080218
.equ GDMA_OUTFIFO_STATUS_CH2_REG,         0x60080258
.equ GDMA_OUT_STATE_CH2_REG,              0x60080264
.equ GDMA_OUT_EOF_DES_ADDR_CH2_REG,       0x60080268
.equ GDMA_OUT_EOF_BFR_DES_ADDR_CH2_REG,   0x6008026C
.equ GDMA_OUT_DSCR_CH2_REG,               0x60080270
.equ GDMA_OUT_DSCR_BF0_CH2_REG,           0x60080274
.equ GDMA_OUT_DSCR_BF1_CH2_REG,           0x60080278
# Priority Registers
.equ GDMA_IN_PRI_CH0_REG,                 0x6008009C
.equ GDMA_OUT_PRI_CH0_REG,                0x600800FC
.equ GDMA_IN_PRI_CH1_REG,                 0x6008015C
.equ GDMA_OUT_PRI_CH1_REG,                0x600801BC
.equ GDMA_IN_PRI_CH2_REG,                 0x6008021C
.equ GDMA_OUT_PRI_CH2_REG,                0x6008027C
# Peripheral Select Registers
.equ GDMA_IN_PERI_SEL_CH0_REG,            0x600800A0
.equ GDMA_OUT_PERI_SEL_CH0_REG,           0x60080100
.equ GDMA_IN_PERI_SEL_CH1_REG,            0x60080160
.equ GDMA_OUT_PERI_SEL_CH1_REG,           0x600801C0
.equ GDMA_IN_PERI_SEL_CH2_REG,            0x60080220
.equ GDMA_OUT_PERI_SEL_CH2_REG,           0x60080280
######################################################

######################################################
# eFuse Controller (EFUSE)
# (TRM 184)
######################################################
.equ EFUSE_BASE,            0x600B0800
######################################################

######################################################
# GPIO (GPIO)
# (TRM 255)
######################################################
.equ GPIO_BASE,             0x60091000
# Configuration Registers
.equ GPIO_OUT_REG,          0x60091004
.equ GPIO_OUT_W1TS_REG,     0x60091008
.equ GPIO_OUT_W1TC_REG,     0x6009100C
.equ GPIO_ENABLE_REG,       0x60091020
.equ GPIO_ENABLE_W1TS_REG,  0x60091024
.equ GPIO_ENABLE_W1TC_REG,  0x60091028
.equ GPIO_STRAP_REG,        0x60091038
.equ GPIO_IN_REG,           0x6009103C
# Interrupt Status Registers
.equ GPIO_STATUS_REG,       0x60091044
.equ GPIO_STATUS_W1TS_REG,  0x60091048
.equ GPIO_STATUS_W1TC_REG,  0x6009104C
.equ GPIO_PCPU_INT_REG,     0x6009105C
.equ GPIO_STATUS_NEXT_REG,  0x6009114C
# Pin Configuration Registers
.equ GPIO_PIN0_REG,         0x60091074
.equ GPIO_PIN1_REG,         0x60091078
.equ GPIO_PIN2_REG,         0x6009107C
.equ GPIO_PIN3_REG,         0x60091080
.equ GPIO_PIN4_REG,         0x60091084
.equ GPIO_PIN5_REG,         0x60091088
.equ GPIO_PIN6_REG,         0x6009108C
.equ GPIO_PIN7_REG,         0x60091090
.equ GPIO_PIN8_REG,         0x60091094
.equ GPIO_PIN9_REG,         0x60091098
.equ GPIO_PIN10_REG,        0x6009109C
.equ GPIO_PIN11_REG,        0x600910A0
.equ GPIO_PIN12_REG,        0x600910A4
.equ GPIO_PIN13_REG,        0x600910A8
.equ GPIO_PIN14_REG,        0x600910AC
.equ GPIO_PIN15_REG,        0x600910B0
.equ GPIO_PIN16_REG,        0x600910B4
.equ GPIO_PIN17_REG,        0x600910B8
.equ GPIO_PIN18_REG,        0x600910BC
.equ GPIO_PIN19_REG,        0x600910C0
.equ GPIO_PIN20_REG,        0x600910C4
.equ GPIO_PIN21_REG,        0x600910C8
.equ GPIO_PIN22_REG,        0x600910CC
.equ GPIO_PIN23_REG,        0x600910D0
.equ GPIO_PIN24_REG,        0x600910D4
.equ GPIO_PIN25_REG,        0x600910D8
.equ GPIO_PIN26_REG,        0x600910DC
.equ GPIO_PIN27_REG,        0x600910E0
.equ GPIO_PIN28_REG,        0x600910E4
.equ GPIO_PIN29_REG,        0x600910E8
.equ GPIO_PIN30_REG,        0x600910EC
# Input Function Configuration Registers
.equ GPIO_FUNC0_IN_SEL_CFG_REG,   0x60091154
.equ GPIO_FUNC1_IN_SEL_CFG_REG,   0x60091158
.equ GPIO_FUNC2_IN_SEL_CFG_REG,   0x6009115C
.equ GPIO_FUNC3_IN_SEL_CFG_REG,   0x60091160
.equ GPIO_FUNC4_IN_SEL_CFG_REG,   0x60091164
.equ GPIO_FUNC5_IN_SEL_CFG_REG,   0x60091168
.equ GPIO_FUNC6_IN_SEL_CFG_REG,   0x6009116C
.equ GPIO_FUNC7_IN_SEL_CFG_REG,   0x60091170
.equ GPIO_FUNC8_IN_SEL_CFG_REG,   0x60091174
.equ GPIO_FUNC9_IN_SEL_CFG_REG,   0x60091178
.equ GPIO_FUNC10_IN_SEL_CFG_REG,  0x6009117C
.equ GPIO_FUNC11_IN_SEL_CFG_REG,  0x60091180
.equ GPIO_FUNC12_IN_SEL_CFG_REG,  0x60091184
.equ GPIO_FUNC13_IN_SEL_CFG_REG,  0x60091188
.equ GPIO_FUNC14_IN_SEL_CFG_REG,  0x6009118C
.equ GPIO_FUNC15_IN_SEL_CFG_REG,  0x60091190
.equ GPIO_FUNC16_IN_SEL_CFG_REG,  0x60091194
.equ GPIO_FUNC17_IN_SEL_CFG_REG,  0x60091198
.equ GPIO_FUNC18_IN_SEL_CFG_REG,  0x6009119C
.equ GPIO_FUNC19_IN_SEL_CFG_REG,  0x600911A0
.equ GPIO_FUNC20_IN_SEL_CFG_REG,  0x600911A4
.equ GPIO_FUNC21_IN_SEL_CFG_REG,  0x600911A8
.equ GPIO_FUNC22_IN_SEL_CFG_REG,  0x600911AC
.equ GPIO_FUNC23_IN_SEL_CFG_REG,  0x600911B0
.equ GPIO_FUNC24_IN_SEL_CFG_REG,  0x600911B4
.equ GPIO_FUNC25_IN_SEL_CFG_REG,  0x600911B8
.equ GPIO_FUNC26_IN_SEL_CFG_REG,  0x600911BC
.equ GPIO_FUNC27_IN_SEL_CFG_REG,  0x600911C0
.equ GPIO_FUNC28_IN_SEL_CFG_REG,  0x600911C4
.equ GPIO_FUNC29_IN_SEL_CFG_REG,  0x600911C8
.equ GPIO_FUNC30_IN_SEL_CFG_REG,  0x600911CC
.equ GPIO_FUNC31_IN_SEL_CFG_REG,  0x600911D0
.equ GPIO_FUNC32_IN_SEL_CFG_REG,  0x600911D4
.equ GPIO_FUNC33_IN_SEL_CFG_REG,  0x600911D8
.equ GPIO_FUNC34_IN_SEL_CFG_REG,  0x600911DC
.equ GPIO_FUNC35_IN_SEL_CFG_REG,  0x600911E0
.equ GPIO_FUNC36_IN_SEL_CFG_REG,  0x600911E4
.equ GPIO_FUNC37_IN_SEL_CFG_REG,  0x600911E8
.equ GPIO_FUNC38_IN_SEL_CFG_REG,  0x600911EC
.equ GPIO_FUNC39_IN_SEL_CFG_REG,  0x600911F0
.equ GPIO_FUNC40_IN_SEL_CFG_REG,  0x600911F4
.equ GPIO_FUNC41_IN_SEL_CFG_REG,  0x600911F8
.equ GPIO_FUNC42_IN_SEL_CFG_REG,  0x600911FC
.equ GPIO_FUNC43_IN_SEL_CFG_REG,  0x60091200
.equ GPIO_FUNC44_IN_SEL_CFG_REG,  0x60091204
.equ GPIO_FUNC45_IN_SEL_CFG_REG,  0x60091208
.equ GPIO_FUNC46_IN_SEL_CFG_REG,  0x6009120C
.equ GPIO_FUNC47_IN_SEL_CFG_REG,  0x60091210
.equ GPIO_FUNC48_IN_SEL_CFG_REG,  0x60091214
.equ GPIO_FUNC49_IN_SEL_CFG_REG,  0x60091218
.equ GPIO_FUNC50_IN_SEL_CFG_REG,  0x6009121C
.equ GPIO_FUNC51_IN_SEL_CFG_REG,  0x60091220
.equ GPIO_FUNC52_IN_SEL_CFG_REG,  0x60091224
.equ GPIO_FUNC53_IN_SEL_CFG_REG,  0x60091228
.equ GPIO_FUNC54_IN_SEL_CFG_REG,  0x6009122C
.equ GPIO_FUNC55_IN_SEL_CFG_REG,  0x60091230
.equ GPIO_FUNC56_IN_SEL_CFG_REG,  0x60091234
.equ GPIO_FUNC57_IN_SEL_CFG_REG,  0x60091238
.equ GPIO_FUNC58_IN_SEL_CFG_REG,  0x6009123C
.equ GPIO_FUNC59_IN_SEL_CFG_REG,  0x60091240
.equ GPIO_FUNC60_IN_SEL_CFG_REG,  0x60091244
.equ GPIO_FUNC61_IN_SEL_CFG_REG,  0x60091248
.equ GPIO_FUNC62_IN_SEL_CFG_REG,  0x6009124C
.equ GPIO_FUNC63_IN_SEL_CFG_REG,  0x60091250
.equ GPIO_FUNC64_IN_SEL_CFG_REG,  0x60091254
.equ GPIO_FUNC65_IN_SEL_CFG_REG,  0x60091258
.equ GPIO_FUNC66_IN_SEL_CFG_REG,  0x6009125C
.equ GPIO_FUNC67_IN_SEL_CFG_REG,  0x60091260
.equ GPIO_FUNC68_IN_SEL_CFG_REG,  0x60091264
.equ GPIO_FUNC69_IN_SEL_CFG_REG,  0x60091268
.equ GPIO_FUNC70_IN_SEL_CFG_REG,  0x6009126C
.equ GPIO_FUNC71_IN_SEL_CFG_REG,  0x60091270
.equ GPIO_FUNC72_IN_SEL_CFG_REG,  0x60091274
.equ GPIO_FUNC73_IN_SEL_CFG_REG,  0x60091278
.equ GPIO_FUNC74_IN_SEL_CFG_REG,  0x6009127C
.equ GPIO_FUNC75_IN_SEL_CFG_REG,  0x60091280
.equ GPIO_FUNC76_IN_SEL_CFG_REG,  0x60091284
.equ GPIO_FUNC77_IN_SEL_CFG_REG,  0x60091288
.equ GPIO_FUNC78_IN_SEL_CFG_REG,  0x6009128C
.equ GPIO_FUNC79_IN_SEL_CFG_REG,  0x60091290
.equ GPIO_FUNC80_IN_SEL_CFG_REG,  0x60091294
.equ GPIO_FUNC81_IN_SEL_CFG_REG,  0x60091298
.equ GPIO_FUNC82_IN_SEL_CFG_REG,  0x6009129C
.equ GPIO_FUNC83_IN_SEL_CFG_REG,  0x600912A0
.equ GPIO_FUNC84_IN_SEL_CFG_REG,  0x600912A4
.equ GPIO_FUNC85_IN_SEL_CFG_REG,  0x600912A8
.equ GPIO_FUNC86_IN_SEL_CFG_REG,  0x600912AC
.equ GPIO_FUNC87_IN_SEL_CFG_REG,  0x600912B0
.equ GPIO_FUNC88_IN_SEL_CFG_REG,  0x600912B4
.equ GPIO_FUNC89_IN_SEL_CFG_REG,  0x600912B8
.equ GPIO_FUNC90_IN_SEL_CFG_REG,  0x600912BC
.equ GPIO_FUNC91_IN_SEL_CFG_REG,  0x600912C0
.equ GPIO_FUNC92_IN_SEL_CFG_REG,  0x600912C4
.equ GPIO_FUNC93_IN_SEL_CFG_REG,  0x600912C8
.equ GPIO_FUNC94_IN_SEL_CFG_REG,  0x600912CC
.equ GPIO_FUNC95_IN_SEL_CFG_REG,  0x600912D0
.equ GPIO_FUNC96_IN_SEL_CFG_REG,  0x600912D4
.equ GPIO_FUNC97_IN_SEL_CFG_REG,  0x600912D8
.equ GPIO_FUNC98_IN_SEL_CFG_REG,  0x600912DC
.equ GPIO_FUNC99_IN_SEL_CFG_REG,  0x600912E0
.equ GPIO_FUNC100_IN_SEL_CFG_REG, 0x600912E4
.equ GPIO_FUNC101_IN_SEL_CFG_REG, 0x600912E8
.equ GPIO_FUNC102_IN_SEL_CFG_REG, 0x600912EC
.equ GPIO_FUNC103_IN_SEL_CFG_REG, 0x600912F0
.equ GPIO_FUNC104_IN_SEL_CFG_REG, 0x600912F4
.equ GPIO_FUNC105_IN_SEL_CFG_REG, 0x600912F8
.equ GPIO_FUNC106_IN_SEL_CFG_REG, 0x600912FC
.equ GPIO_FUNC107_IN_SEL_CFG_REG, 0x60091300
.equ GPIO_FUNC108_IN_SEL_CFG_REG, 0x60091304
.equ GPIO_FUNC109_IN_SEL_CFG_REG, 0x60091308
.equ GPIO_FUNC110_IN_SEL_CFG_REG, 0x6009130C
.equ GPIO_FUNC111_IN_SEL_CFG_REG, 0x60091310
.equ GPIO_FUNC112_IN_SEL_CFG_REG, 0x60091314
.equ GPIO_FUNC113_IN_SEL_CFG_REG, 0x60091318
.equ GPIO_FUNC114_IN_SEL_CFG_REG, 0x6009131C
.equ GPIO_FUNC115_IN_SEL_CFG_REG, 0x60091320
.equ GPIO_FUNC116_IN_SEL_CFG_REG, 0x60091324
.equ GPIO_FUNC117_IN_SEL_CFG_REG, 0x60091328
.equ GPIO_FUNC118_IN_SEL_CFG_REG, 0x6009132C
.equ GPIO_FUNC119_IN_SEL_CFG_REG, 0x60091330
.equ GPIO_FUNC120_IN_SEL_CFG_REG, 0x60091334
.equ GPIO_FUNC121_IN_SEL_CFG_REG, 0x60091338
.equ GPIO_FUNC122_IN_SEL_CFG_REG, 0x6009133C
.equ GPIO_FUNC123_IN_SEL_CFG_REG, 0x60091340
.equ GPIO_FUNC124_IN_SEL_CFG_REG, 0x60091344
.equ GPIO_FUNC125_IN_SEL_CFG_REG, 0x60091348
.equ GPIO_FUNC126_IN_SEL_CFG_REG, 0x6009134C
.equ GPIO_FUNC127_IN_SEL_CFG_REG, 0x60091350
# Output Function Configuration Registers
.equ GPIO_FUNC0_OUT_SEL_CFG_REG,  0x60091554
.equ GPIO_FUNC1_OUT_SEL_CFG_REG,  0x60091558
.equ GPIO_FUNC2_OUT_SEL_CFG_REG,  0x6009155C
.equ GPIO_FUNC3_OUT_SEL_CFG_REG,  0x60091560
.equ GPIO_FUNC4_OUT_SEL_CFG_REG,  0x60091564
.equ GPIO_FUNC5_OUT_SEL_CFG_REG,  0x60091568
.equ GPIO_FUNC6_OUT_SEL_CFG_REG,  0x6009156C
.equ GPIO_FUNC7_OUT_SEL_CFG_REG,  0x60091570
.equ GPIO_FUNC8_OUT_SEL_CFG_REG,  0x60091574
.equ GPIO_FUNC9_OUT_SEL_CFG_REG,  0x60091578
.equ GPIO_FUNC10_OUT_SEL_CFG_REG, 0x6009157C
.equ GPIO_FUNC11_OUT_SEL_CFG_REG, 0x60091580
.equ GPIO_FUNC12_OUT_SEL_CFG_REG, 0x60091584
.equ GPIO_FUNC13_OUT_SEL_CFG_REG, 0x60091588
.equ GPIO_FUNC14_OUT_SEL_CFG_REG, 0x6009158C
.equ GPIO_FUNC15_OUT_SEL_CFG_REG, 0x60091590
.equ GPIO_FUNC16_OUT_SEL_CFG_REG, 0x60091594
.equ GPIO_FUNC17_OUT_SEL_CFG_REG, 0x60091598
.equ GPIO_FUNC18_OUT_SEL_CFG_REG, 0x6009159C
.equ GPIO_FUNC19_OUT_SEL_CFG_REG, 0x600915A0
.equ GPIO_FUNC20_OUT_SEL_CFG_REG, 0x600915A4
.equ GPIO_FUNC21_OUT_SEL_CFG_REG, 0x600915A8
.equ GPIO_FUNC22_OUT_SEL_CFG_REG, 0x600915AC
.equ GPIO_FUNC23_OUT_SEL_CFG_REG, 0x600915B0
.equ GPIO_FUNC24_OUT_SEL_CFG_REG, 0x600915B4
.equ GPIO_FUNC25_OUT_SEL_CFG_REG, 0x600915B8
.equ GPIO_FUNC26_OUT_SEL_CFG_REG, 0x600915BC
.equ GPIO_FUNC27_OUT_SEL_CFG_REG, 0x600915C0
.equ GPIO_FUNC28_OUT_SEL_CFG_REG, 0x600915C4
.equ GPIO_FUNC29_OUT_SEL_CFG_REG, 0x600915C8
.equ GPIO_FUNC30_OUT_SEL_CFG_REG, 0x600915CC
# Version Register
.equ GPIO_DATE_REG,               0x600916FC
# Clock Gate Register
.equ GPIO_CLOCK_GATE_REG,         0x6009162C
######################################################

######################################################
# IO MUX (IO MUX)
# (TRM 257)
######################################################
# Configuration Registers
.equ IO_MUX_BASE,                 0x60090000
.equ IO_MUX_PIN_CTRL_REG,         0x60090000
.equ IO_MUX_GPIO0_REG,            0x60090004
.equ IO_MUX_GPIO1_REG,            0x60090008
.equ IO_MUX_GPIO2_REG,            0x6009000C
.equ IO_MUX_GPIO3_REG,            0x60090010
.equ IO_MUX_GPIO4_REG,            0x60090014
.equ IO_MUX_GPIO5_REG,            0x60090018
.equ IO_MUX_GPIO6_REG,            0x6009001C
.equ IO_MUX_GPIO7_REG,            0x60090020
.equ IO_MUX_GPIO8_REG,            0x60090024
.equ IO_MUX_GPIO9_REG,            0x60090028
.equ IO_MUX_GPIO10_REG,           0x6009002C
.equ IO_MUX_GPIO11_REG,           0x60090030
.equ IO_MUX_GPIO12_REG,           0x60090034
.equ IO_MUX_GPIO13_REG,           0x60090038
.equ IO_MUX_GPIO14_REG,           0x6009003C
.equ IO_MUX_GPIO15_REG,           0x60090040
.equ IO_MUX_GPIO16_REG,           0x60090044
.equ IO_MUX_GPIO17_REG,           0x60090048
.equ IO_MUX_GPIO18_REG,           0x6009004C
.equ IO_MUX_GPIO19_REG,           0x60090050
.equ IO_MUX_GPIO20_REG,           0x60090054
.equ IO_MUX_GPIO21_REG,           0x60090058
.equ IO_MUX_GPIO22_REG,           0x6009005C
.equ IO_MUX_GPIO23_REG,           0x60090060
.equ IO_MUX_GPIO24_REG,           0x60090064
.equ IO_MUX_GPIO25_REG,           0x60090068
.equ IO_MUX_GPIO26_REG,           0x6009006C
.equ IO_MUX_GPIO27_REG,           0x60090070
.equ IO_MUX_GPIO28_REG,           0x60090074
.equ IO_MUX_GPIO29_REG,           0x60090078
.equ IO_MUX_GPIO30_REG,           0x6009007C
# Version Register
.equ IO_MUX_DATE_REG,             0x600900FC
######################################################

######################################################
# GPIO_EXT Registers
# (TRM 258)
######################################################
.equ GPIO_EXT_BASE,                  0x60091F00
# SDM Configure Registers
.equ GPIO_EXT_SIGMADELTA0_REG,       0x60091F00
.equ GPIO_EXT_SIGMADELTA0_REG,       0x60091F04
.equ GPIO_EXT_SIGMADELTA0_REG,       0x60091F08
.equ GPIO_EXT_SIGMADELTA0_REG,       0x60091F0C
.equ GPIO_EXT_SIGMADELTA_MISC_REG,   0x60091F24
# Glitch Filter Configuration Registers
.equ GPIO_EXT_GLITCH_FILTER_CH0_REG, 0x60091F30
.equ GPIO_EXT_GLITCH_FILTER_CH0_REG, 0x60091F34
.equ GPIO_EXT_GLITCH_FILTER_CH0_REG, 0x60091F38
.equ GPIO_EXT_GLITCH_FILTER_CH0_REG, 0x60091F3C
.equ GPIO_EXT_GLITCH_FILTER_CH0_REG, 0x60091F40
.equ GPIO_EXT_GLITCH_FILTER_CH0_REG, 0x60091F44
.equ GPIO_EXT_GLITCH_FILTER_CH0_REG, 0x60091F48
.equ GPIO_EXT_GLITCH_FILTER_CH0_REG, 0x60091F4C
# ETM Configuration Registers
.equ GPIO_EXT_ETM_EVENT_CH0_CFG_REG, 0x60091F60
.equ GPIO_EXT_ETM_EVENT_CH1_CFG_REG, 0x60091F64
.equ GPIO_EXT_ETM_EVENT_CH2_CFG_REG, 0x60091F68
.equ GPIO_EXT_ETM_EVENT_CH3_CFG_REG, 0x60091F6C
.equ GPIO_EXT_ETM_EVENT_CH4_CFG_REG, 0x60091F70
.equ GPIO_EXT_ETM_EVENT_CH5_CFG_REG, 0x60091F74
.equ GPIO_EXT_ETM_EVENT_CH6_CFG_REG, 0x60091F78
.equ GPIO_EXT_ETM_EVENT_CH7_CFG_REG, 0x60091F7C
.equ GPIO_EXT_ETM_TASK_P0_CFG_REG,   0x60091FA0
.equ GPIO_EXT_ETM_TASK_P1_CFG_REG,   0x60091FA4
.equ GPIO_EXT_ETM_TASK_P2_CFG_REG,   0x60091FA8
.equ GPIO_EXT_ETM_TASK_P3_CFG_REG,   0x60091FAC
.equ GPIO_EXT_ETM_TASK_P4_CFG_REG,   0x60091FB0
.equ GPIO_EXT_ETM_TASK_P5_CFG_REG,   0x60091FB4
.equ GPIO_EXT_ETM_TASK_P6_CFG_REG,   0x60091FB8
.equ GPIO_EXT_ETM_TASK_P7_CFG_REG,   0x60091FBC
# Version Register
.equ GPIO_EXT_VERSION_REG,           0x60091FFC
######################################################

######################################################
# LP IO MUX Registers
# (TRM 259)
######################################################
.equ LP_IO_BASE,                   0x600B2000
# GPIO Configuration/Data Registers
.equ LP_IO_OUT_REG,                0x600B2000
.equ LP_IO_OUT_W1TS_REG,           0x600B2004
.equ LP_IO_OUT_W1TC_REG,           0x600B2008
.equ LP_IO_ENABLE_REG,             0x600B200C
.equ LP_IO_ENABLE_W1TS_REG,        0x600B2010
.equ LP_IO_ENABLE_W1TC_REG,        0x600B2014
.equ LP_IO_STATUS_REG,             0x600B2018
.equ LP_IO_STATUS_W1TS_REG,        0x600B201C
.equ LP_IO_STATUS_W1TC_REG,        0x600B2020
.equ LP_IO_IN_REG,                 0x600B2024
.equ LP_IO_PIN0_REG,               0x600B2028
.equ LP_IO_PIN1_REG,               0x600B202C
.equ LP_IO_PIN2_REG,               0x600B2030
.equ LP_IO_PIN3_REG,               0x600B2034
.equ LP_IO_PIN4_REG,               0x600B2038
.equ LP_IO_PIN5_REG,               0x600B203C
.equ LP_IO_PIN6_REG,               0x600B2040
.equ LP_IO_PIN7_REG,               0x600B2044
# GPIO LP Function Configuration Registers
.equ LP_IO_GPIO0_REG,              0x600B2048
.equ LP_IO_GPIO1_REG,              0x600B204C
.equ LP_IO_GPIO2_REG,              0x600B2050
.equ LP_IO_GPIO3_REG,              0x600B2054
.equ LP_IO_GPIO4_REG,              0x600B2058
.equ LP_IO_GPIO5_REG,              0x600B205C
.equ LP_IO_GPIO6_REG,              0x600B2060
.equ LP_IO_GPIO7_REG,              0x600B2064
.equ LP_IO_STATUS_INT_REG,         0x600B2068
# Version Register
.equ LP_IO_DATE_REG,               0x600B23FC
######################################################

