codeljo/riscv-bare-metal/esp32c6/include/registers.inc
######################################################
# PCR Registers (PCR) (Power Clock Reset)
# (TRM 305)
######################################################
.equ PCR_BASE,                              0x60096000
# Configuration Registers
.equ PCR_UART0_CONF_REG,                    0x60096000
.equ PCR_UART0_SCLK_CONF_REG,               0x60096004
.equ PCR_UART0_PD_CTRL_REG,                 0x60096008
.equ PCR_UART1_CONF_REG,                    0x6009600C
.equ PCR_UART1_SCLK_CONF_REG,               0x60096010
.equ PCR_UART1_PD_CTRL_REG,                 0x60096014
.equ PCR_I2C_CONF_REG,                      0x60096020
.equ PCR_I2C_SCLK_CONF_REG,                 0x60096024
.equ PCR_UHCI_CONF_REG,                     0x60096028
.equ PCR_RMT_CONF_REG,                      0x6009602C
.equ PCR_RMT_SCLK_CONF_REG,                 0x60096030
.equ PCR_LEDC_CONF_REG,                     0x60096034
.equ PCR_LEDC_SCLK_CONF_REG,                0x60096038
.equ PCR_TIMERGROUP0_CONF_REG,              0x6009603C
.equ PCR_TIMERGROUP0_TIMER_CLK_CONF_REG,    0x60096040
.equ PCR_TIMERGROUP0_WDT_CLK_CONF_REG,      0x60096044
.equ PCR_TIMERGROUP1_CONF_REG,              0x60096048
.equ PCR_TIMERGROUP1_TIMER_CLK_CONF_REG,    0x6009604C
.equ PCR_TIMERGROUP1_WDT_CLK_CONF_REG,      0x60096050
.equ PCR_SYSTIMER_CONF_REG,                 0x60096054
.equ PCR_SYSTIMER_FUNC_CLK_CONF_REG,        0x60096058
.equ PCR_TWAI0_CONF_REG,                    0x6009605C
.equ PCR_TWAI0_FUNC_CLK_CONF_REG,           0x60096060
.equ PCR_TWAI1_CONF_REG,                    0x60096064
.equ PCR_TWAI1_FUNC_CLK_CONF_REG,           0x60096068
.equ PCR_I2S_CONF_REG,                      0x6009606C
.equ PCR_I2S_TX_CLKM_CONF_REG,              0x60096070
.equ PCR_I2S_TX_CLKM_DIV_CONF_REG,          0x60096074
.equ PCR_I2S_RX_CLKM_CONF_REG,              0x60096078
.equ PCR_I2S_RX_CLKM_DIV_CONF_REG,          0x6009607C
.equ PCR_SARADC_CONF_REG,                   0x60096080
.equ PCR_SARADC_CLKM_CONF_REG,              0x60096084
.equ PCR_TSENS_CLK_CONF_REG,                0x60096088
.equ PCR_USB_SERIAL_JTAG_CONF_REG,          0x6009608C
.equ PCR_INTMTX_CONF_REG,                   0x60096090
.equ PCR_PCNT_CONF_REG,                     0x60096094
.equ PCR_ETM_CONF_REG,                      0x60096098
.equ PCR_PWM_CONF_REG,                      0x6009609C
.equ PCR_PWM_CLK_CONF_REG,                  0x600960A0
.equ PCR_PARL_IO_CONF_REG,                  0x600960A4
.equ PCR_PARL_CLK_RX_CONF_REG,              0x600960A8
.equ PCR_PARL_CLK_TX_CONF_REG,              0x600960AC
.equ PCR_SDIO_SLAVE_CONF_REG,               0x600960B0
.equ PCR_GDMA_CONF_REG,                     0x600960BC
.equ PCR_SPI2_CONF_REG,                     0x600960C0
.equ PCR_SPI2_CLKM_CONF_REG,                0x600960C4
.equ PCR_AES_CONF_REG,                      0x600960C8
.equ PCR_SHA_CONF_REG,                      0x600960CC
.equ PCR_RSA_CONF_REG,                      0x600960D0
.equ PCR_RSA_PD_CTRL_REG,                   0x600960D4
.equ PCR_ECC_CONF_REG,                      0x600960D8
.equ PCR_ECC_PD_CTRL_REG,                   0x600960DC
.equ PCR_DS_CONF_REG,                       0x600960E0
.equ PCR_HMAC_CONF_REG,                     0x600960E4
.equ PCR_IOMUX_CONF_REG,                    0x600960E8
.equ PCR_IOMUX_CLK_CONF_REG,                0x600960EC
.equ PCR_MEM_MONITOR_CONF_REG,              0x600960F0
.equ PCR_TRACE_CONF_REG,                    0x600960FC
.equ PCR_ASSIST_CONF_REG,                   0x60096100
.equ PCR_CACHE_CONF_REG,                    0x60096104
.equ PCR_MODEM_APB_CONF_REG,                0x60096108
.equ PCR_TIMEOUT_CONF_REG,                  0x6009610C
.equ PCR_SYSCLK_CONF_REG,                   0x60096110
.equ PCR_CPU_WAITI_CONF_REG,                0x60096114
.equ PCR_CPU_FREQ_CONF_REG,                 0x60096118
.equ PCR_AHB_FREQ_CONF_REG,                 0x6009611C
.equ PCR_APB_FREQ_CONF_REG,                 0x60096120
.equ PCR_PLL_DIV_CLK_EN_REG,                0x60096128
.equ PCR_CTRL_32K_CONF_REG,                 0x60096134
.equ PCR_SRAM_POWER_CONF_REG,               0x60096138
.equ PCR_RESET_EVENT_BYPASS_REG,            0x60096FF0
# Frequency Statistics Register
.equ PCR_SYSCLK_FREQ_QUERY_0_REG,           0x60096124
# Version Register
.equ PCR_DATE_REG,                          0x60096FFC
######################################################

######################################################
# Low-power Clock/Reset (LP_CLKRST)
# (TRM 307)
######################################################
.equ LP_CLKRST_BASE,                        0x600B0400
# Configuration Registers
.equ LP_CLKRST_LP_CLK_CONF_REG,             0x600B0400
.equ LP_CLKRST_LP_CLK_PO_EN_REG,            0x600B0404
.equ LP_CLKRST_LP_CLK_EN_REG,               0x600B0408
.equ LP_CLKRST_LP_RST_EN_REG,               0x600B040C
.equ LP_CLKRST_RESET_CAUSE_REG,             0x600B0410
.equ LP_CLKRST_CPU_RESET_REG,               0x600B0414
.equ LP_CLKRST_FOSC_CNTL_REG,               0x600B0418
.equ LP_CLKRST_RC32K_CNTL_REG,              0x600B041C
.equ LP_CLKRST_CLK_TO_HP_REG,               0x600B0420
.equ LP_CLKRST_LPMEM_FORCE_REG,             0x600B0424
.equ LP_CLKRST_LPPERI_REG,                  0x600B0428
.equ LP_CLKRST_XTAL32K_REG,                 0x600B042C
.equ LP_CLKRST_DATE_REG,                    0x600B07FC
######################################################

######################################################
# Interrupt Matrix (INTMTX)
# (TRM 374)
######################################################
.equ INTMTX_BASE,                                  0x60010000
# Interrupt Source Mapping Register
.equ INTMTX_CORE0_PMU_INTR_MAP_REG,                0x60010034
.equ INTMTX_CORE0_EFUSE_INTR_MAP_REG,              0x60010038
.equ INTMTX_CORE0_LP_RTC_TIMER_INTR_MAP_REG,       0x6001003C
.equ INTMTX_CORE0_LP_UART_INTR_MAP_REG,            0x60010040
.equ INTMTX_CORE0_LP_I2C_INTR_MAP_REG,             0x60010044
.equ INTMTX_CORE0_LP_WDT_INTR_MAP_REG,             0x60010048
.equ INTMTX_CORE0_LP_PERI_TIMEOUT_INTR_MAP_REG,    0x6001004C
.equ INTMTX_CORE0_LP_APM_M0_INTR_MAP_REG,          0x60010050
.equ INTMTX_CORE0_LP_APM_M1_INTR_MAP_REG,          0x60010054
.equ INTMTX_CORE0_CPU_INTR_FROM_CPU_0_MAP_REG,     0x60010058
.equ INTMTX_CORE0_CPU_INTR_FROM_CPU_1_MAP_REG,     0x6001005C
.equ INTMTX_CORE0_CPU_INTR_FROM_CPU_2_MAP_REG,     0x60010060
.equ INTMTX_CORE0_CPU_INTR_FROM_CPU_3_MAP_REG,     0x60010064
.equ INTMTX_CORE0_ASSIST_DEBUG_INTR_MAP_REG,       0x60010068
.equ INTMTX_CORE0_TRACE_INTR_MAP_REG,              0x6001006C
.equ INTMTX_CORE0_CACHE_INTR_MAP_REG,              0x60010070
.equ INTMTX_CORE0_CPU_PERI_TIMEOUT_INTR_MAP_REG,   0x60010074
.equ INTMTX_CORE0_GPIO_INTERRUPT_PRO_MAP_REG,      0x60010078
.equ INTMTX_CORE0_HP_PERI_TIMEOUT_INTR_MAP_REG,    0x60010084
.equ INTMTX_CORE0_HP_APM_M0_INTR_MAP_REG,          0x6001008C
.equ INTMTX_CORE0_HP_APM_M1_INTR_MAP_REG,          0x60010090
.equ INTMTX_CORE0_HP_APM_M2_INTR_MAP_REG,          0x60010094
.equ INTMTX_CORE0_HP_APM_M3_INTR_MAP_REG,          0x60010098
.equ INTMTX_CORE0_LP_APM0_INTR_MAP_REG,            0x6001009C
.equ INTMTX_CORE0_MSPI_INTR_MAP_REG,               0x600100A0
.equ INTMTX_CORE0_I2S_INTR_MAP_REG,                0x600100A4
.equ INTMTX_CORE0_UHCI0_INTR_MAP_REG,              0x600100A8
.equ INTMTX_CORE0_UART0_INTR_MAP_REG,              0x600100AC
.equ INTMTX_CORE0_UART1_INTR_MAP_REG,              0x600100B0
.equ INTMTX_CORE0_LEDC_INTR_MAP_REG,               0x600100B4
.equ INTMTX_CORE0_TWAI0_INTR_MAP_REG,              0x600100B8
.equ INTMTX_CORE0_TWAI1_INTR_MAP_REG,              0x600100BC
.equ INTMTX_CORE0_USB_INTR_MAP_REG,                0x600100C0
.equ INTMTX_CORE0_RMT_INTR_MAP_REG,                0x600100C4
.equ INTMTX_CORE0_I2C_EXT0_INTR_MAP_REG,           0x600100C8
.equ INTMTX_CORE0_TG0_T0_INTR_MAP_REG,             0x600100CC
.equ INTMTX_CORE0_TG0_WDT_INTR_MAP_REG,            0x600100D4
.equ INTMTX_CORE0_TG1_T0_INTR_MAP_REG,             0x600100D8
.equ INTMTX_CORE0_TG1_WDT_INTR_MAP_REG,            0x600100E0
.equ INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP_REG,   0x600100E4
.equ INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP_REG,   0x600100E8
.equ INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP_REG,   0x600100EC
.equ INTMTX_CORE0_APB_ADC_INTR_MAP_REG,            0x600100F0
.equ INTMTX_CORE0_PWM_INTR_MAP_REG,                0x600100F4
.equ INTMTX_CORE0_PCNT_INTR_MAP_REG,               0x600100F8
.equ INTMTX_CORE0_PARL_IO_INTR_MAP_REG,            0x600100FC
.equ INTMTX_CORE0_SLC0_INTR_MAP_REG,               0x60010100
.equ INTMTX_CORE0_SLC1_INTR_MAP_REG,               0x60010104
.equ INTMTX_CORE0_DMA_IN_CH0_INTR_MAP_REG,         0x60010108
.equ INTMTX_CORE0_DMA_IN_CH1_INTR_MAP_REG,         0x6001010C
.equ INTMTX_CORE0_DMA_IN_CH2_INTR_MAP_REG,         0x60010110
.equ INTMTX_CORE0_DMA_OUT_CH0_INTR_MAP_REG,        0x60010114
.equ INTMTX_CORE0_DMA_OUT_CH1_INTR_MAP_REG,        0x60010118
.equ INTMTX_CORE0_DMA_OUT_CH2_INTR_MAP_REG,        0x6001011C
.equ INTMTX_CORE0_GPSPI2_INTR_MAP_REG,             0x60010120
.equ INTMTX_CORE0_AES_INTR_MAP_REG,                0x60010124
.equ INTMTX_CORE0_SHA_INTR_MAP_REG,                0x60010128
.equ INTMTX_CORE0_RSA_INTR_MAP_REG,                0x6001012C
.equ INTMTX_CORE0_ECC_INTR_MAP_REG,                0x60010130
# Interrupt Status Register
.equ INTMTX_CORE0_INT_STATUS_0_REG,                0x60010134
.equ INTMTX_CORE0_INT_STATUS_1_REG,                0x60010138
.equ INTMTX_CORE0_INT_STATUS_2_REG,                0x6001013C
# Version Register
.equ INTMTX_CORE0_INTERRUPT_REG_DATE_REG,          0x600107FC
######################################################

######################################################
# Interrupt Priority Registers
# # (TRM 376)
######################################################
.equ INTPRI_BASE,                            0x600C5000
# Configuration Registers
.equ INTPRI_CORE0_CPU_INT_ENABLE_REG,        0x600C5000
.equ INTPRI_CORE0_CPU_INT_TYPE_REG,          0x600C5004
.equ INTPRI_CORE0_CPU_INT_EIP_STATUS_REG,    0x600C5008
.equ INTPRI_CORE0_CPU_INT_PRI_0_REG,         0x600C500C
.equ INTPRI_CORE0_CPU_INT_PRI_1_REG,         0x600C5010
.equ INTPRI_CORE0_CPU_INT_PRI_2_REG,         0x600C5014
.equ INTPRI_CORE0_CPU_INT_PRI_3_REG,         0x600C5018
.equ INTPRI_CORE0_CPU_INT_PRI_4_REG,         0x600C501C
.equ INTPRI_CORE0_CPU_INT_PRI_5_REG,         0x600C5020
.equ INTPRI_CORE0_CPU_INT_PRI_6_REG,         0x600C5024
.equ INTPRI_CORE0_CPU_INT_PRI_7_REG,         0x600C5028
.equ INTPRI_CORE0_CPU_INT_PRI_8_REG,         0x600C502C
.equ INTPRI_CORE0_CPU_INT_PRI_9_REG,         0x600C5030
.equ INTPRI_CORE0_CPU_INT_PRI_10_REG,        0x600C5034
.equ INTPRI_CORE0_CPU_INT_PRI_11_REG,        0x600C5038
.equ INTPRI_CORE0_CPU_INT_PRI_12_REG,        0x600C503C
.equ INTPRI_CORE0_CPU_INT_PRI_13_REG,        0x600C5040
.equ INTPRI_CORE0_CPU_INT_PRI_14_REG,        0x600C5044
.equ INTPRI_CORE0_CPU_INT_PRI_15_REG,        0x600C5048
.equ INTPRI_CORE0_CPU_INT_PRI_16_REG,        0x600C504C
.equ INTPRI_CORE0_CPU_INT_PRI_17_REG,        0x600C5050
.equ INTPRI_CORE0_CPU_INT_PRI_18_REG,        0x600C5054
.equ INTPRI_CORE0_CPU_INT_PRI_19_REG,        0x600C5058
.equ INTPRI_CORE0_CPU_INT_PRI_20_REG,        0x600C505C
.equ INTPRI_CORE0_CPU_INT_PRI_21_REG,        0x600C5060
.equ INTPRI_CORE0_CPU_INT_PRI_22_REG,        0x600C5064
.equ INTPRI_CORE0_CPU_INT_PRI_23_REG,        0x600C5068
.equ INTPRI_CORE0_CPU_INT_PRI_24_REG,        0x600C506C
.equ INTPRI_CORE0_CPU_INT_PRI_25_REG,        0x600C5070
.equ INTPRI_CORE0_CPU_INT_PRI_26_REG,        0x600C5074
.equ INTPRI_CORE0_CPU_INT_PRI_27_REG,        0x600C5078
.equ INTPRI_CORE0_CPU_INT_PRI_28_REG,        0x600C507C
.equ INTPRI_CORE0_CPU_INT_PRI_29_REG,        0x600C5080
.equ INTPRI_CORE0_CPU_INT_PRI_30_REG,        0x600C5084
.equ INTPRI_CORE0_CPU_INT_PRI_31_REG,        0x600C5088
.equ INTPRI_CORE0_CPU_INT_THRESH_REG,        0x600C508C
.equ INTPRI_CORE0_CPU_INT_CLEAR_REG,         0x600C50A8
# Interrupt Registers
.equ INTPRI_CPU_INTR_FROM_CPU_0_REG,         0x600C5090
.equ INTPRI_CPU_INTR_FROM_CPU_1_REG,         0x600C5094
.equ INTPRI_CPU_INTR_FROM_CPU_2_REG,         0x600C5098
.equ INTPRI_CPU_INTR_FROM_CPU_3_REG,         0x600C509C
# Version Register
.equ INTPRI_DATE_REG,                        0x600C50A0
######################################################

######################################################
# Event Task Matrix (SOC_ETM)
# (TRM 396)
######################################################
.equ SOC_ETM_BASE,                    0x60013000
# Configuration Register
.equ SOC_ETM_CH_ENA_AD0_REG,          0x60013000
.equ SOC_ETM_CH_ENA_AD0_SET_REG,      0x60013004
.equ SOC_ETM_CH_ENA_AD0_CLR_REG,      0x60013008
.equ SOC_ETM_CH_ENA_AD1_REG,          0x6001300C
.equ SOC_ETM_CH_ENA_AD1_SET_REG,      0x60013010
.equ SOC_ETM_CH_ENA_AD1_CLR_REG,      0x60013014
.equ SOC_ETM_CH0_EVT_ID_REG,          0x60013018
.equ SOC_ETM_CH0_TASK_ID_REG,         0x6001301C
.equ SOC_ETM_CH1_EVT_ID_REG,          0x60013020
.equ SOC_ETM_CH1_TASK_ID_REG,         0x60013024
.equ SOC_ETM_CH2_EVT_ID_REG,          0x60013028
.equ SOC_ETM_CH2_TASK_ID_REG,         0x6001302C
.equ SOC_ETM_CH3_EVT_ID_REG,          0x60013030
.equ SOC_ETM_CH3_TASK_ID_REG,         0x60013034
.equ SOC_ETM_CH4_EVT_ID_REG,          0x60013038
.equ SOC_ETM_CH4_TASK_ID_REG,         0x6001303C
.equ SOC_ETM_CH5_EVT_ID_REG,          0x60013040
.equ SOC_ETM_CH5_TASK_ID_REG,         0x60013044
.equ SOC_ETM_CH6_EVT_ID_REG,          0x60013048
.equ SOC_ETM_CH6_TASK_ID_REG,         0x6001304C
.equ SOC_ETM_CH7_EVT_ID_REG,          0x60013050
.equ SOC_ETM_CH7_TASK_ID_REG,         0x60013054
.equ SOC_ETM_CH8_EVT_ID_REG,          0x60013058
.equ SOC_ETM_CH8_TASK_ID_REG,         0x6001305C
.equ SOC_ETM_CH9_EVT_ID_REG,          0x60013060
.equ SOC_ETM_CH9_TASK_ID_REG,         0x60013064
.equ SOC_ETM_CH10_EVT_ID_REG,         0x60013068
.equ SOC_ETM_CH10_TASK_ID_REG,        0x6001306C
.equ SOC_ETM_CH11_EVT_ID_REG,         0x60013070
.equ SOC_ETM_CH11_TASK_ID_REG,        0x60013074
.equ SOC_ETM_CH12_EVT_ID_REG,         0x60013078
.equ SOC_ETM_CH12_TASK_ID_REG,        0x6001307C
.equ SOC_ETM_CH13_EVT_ID_REG,         0x60013080
.equ SOC_ETM_CH13_TASK_ID_REG,        0x60013084
.equ SOC_ETM_CH14_EVT_ID_REG,         0x60013088
.equ SOC_ETM_CH14_TASK_ID_REG,        0x6001308C
.equ SOC_ETM_CH15_EVT_ID_REG,         0x60013090
.equ SOC_ETM_CH15_TASK_ID_REG,        0x60013094
.equ SOC_ETM_CH16_EVT_ID_REG,         0x60013098
.equ SOC_ETM_CH16_TASK_ID_REG,        0x6001309C
.equ SOC_ETM_CH17_EVT_ID_REG,         0x600130A0
.equ SOC_ETM_CH17_TASK_ID_REG,        0x600130A4
.equ SOC_ETM_CH18_EVT_ID_REG,         0x600130A8
.equ SOC_ETM_CH18_TASK_ID_REG,        0x600130AC
.equ SOC_ETM_CH19_EVT_ID_REG,         0x600130B0
.equ SOC_ETM_CH19_TASK_ID_REG,        0x600130B4
.equ SOC_ETM_CH20_EVT_ID_REG,         0x600130B8
.equ SOC_ETM_CH20_TASK_ID_REG,        0x600130BC
.equ SOC_ETM_CH21_EVT_ID_REG,         0x600130C0
.equ SOC_ETM_CH21_TASK_ID_REG,        0x600130C4
.equ SOC_ETM_CH22_EVT_ID_REG,         0x600130C8
.equ SOC_ETM_CH22_TASK_ID_REG,        0x600130CC
.equ SOC_ETM_CH23_EVT_ID_REG,         0x600130D0
.equ SOC_ETM_CH23_TASK_ID_REG,        0x600130D4
.equ SOC_ETM_CH24_EVT_ID_REG,         0x600130D8
.equ SOC_ETM_CH24_TASK_ID_REG,        0x600130DC
.equ SOC_ETM_CH25_EVT_ID_REG,         0x600130E0
.equ SOC_ETM_CH25_TASK_ID_REG,        0x600130E4
.equ SOC_ETM_CH26_EVT_ID_REG,         0x600130E8
.equ SOC_ETM_CH26_TASK_ID_REG,        0x600130EC
.equ SOC_ETM_CH27_EVT_ID_REG,         0x600130F0
.equ SOC_ETM_CH27_TASK_ID_REG,        0x600130F4
.equ SOC_ETM_CH28_EVT_ID_REG,         0x600130F8
.equ SOC_ETM_CH28_TASK_ID_REG,        0x600130FC
.equ SOC_ETM_CH29_EVT_ID_REG,         0x60013100
.equ SOC_ETM_CH29_TASK_ID_REG,        0x60013104
.equ SOC_ETM_CH30_EVT_ID_REG,         0x60013108
.equ SOC_ETM_CH30_TASK_ID_REG,        0x6001310C
.equ SOC_ETM_CH31_EVT_ID_REG,         0x60013110
.equ SOC_ETM_CH31_TASK_ID_REG,        0x60013114
.equ SOC_ETM_CH32_EVT_ID_REG,         0x60013118
.equ SOC_ETM_CH32_TASK_ID_REG,        0x6001311C
.equ SOC_ETM_CH33_EVT_ID_REG,         0x60013120
.equ SOC_ETM_CH33_TASK_ID_REG,        0x60013124
.equ SOC_ETM_CH34_EVT_ID_REG,         0x60013128
.equ SOC_ETM_CH34_TASK_ID_REG,        0x6001312C
.equ SOC_ETM_CH35_EVT_ID_REG,         0x60013130
.equ SOC_ETM_CH35_TASK_ID_REG,        0x60013134
.equ SOC_ETM_CH36_EVT_ID_REG,         0x60013138
.equ SOC_ETM_CH36_TASK_ID_REG,        0x6001313C
.equ SOC_ETM_CH37_EVT_ID_REG,         0x60013140
.equ SOC_ETM_CH37_TASK_ID_REG,        0x60013144
.equ SOC_ETM_CH38_EVT_ID_REG,         0x60013148
.equ SOC_ETM_CH38_TASK_ID_REG,        0x6001314C
.equ SOC_ETM_CH39_EVT_ID_REG,         0x60013150
.equ SOC_ETM_CH39_TASK_ID_REG,        0x60013154
.equ SOC_ETM_CH40_EVT_ID_REG,         0x60013158
.equ SOC_ETM_CH40_TASK_ID_REG,        0x6001315C
.equ SOC_ETM_CH41_EVT_ID_REG,         0x60013160
.equ SOC_ETM_CH41_TASK_ID_REG,        0x60013164
.equ SOC_ETM_CH42_EVT_ID_REG,         0x60013168
.equ SOC_ETM_CH42_TASK_ID_REG,        0x6001316C
.equ SOC_ETM_CH43_EVT_ID_REG,         0x60013170
.equ SOC_ETM_CH43_TASK_ID_REG,        0x60013174
.equ SOC_ETM_CH44_EVT_ID_REG,         0x60013178
.equ SOC_ETM_CH44_TASK_ID_REG,        0x6001317C
.equ SOC_ETM_CH45_EVT_ID_REG,         0x60013180
.equ SOC_ETM_CH45_TASK_ID_REG,        0x60013184
.equ SOC_ETM_CH46_EVT_ID_REG,         0x60013188
.equ SOC_ETM_CH46_TASK_ID_REG,        0x6001318C
.equ SOC_ETM_CH47_EVT_ID_REG,         0x60013190
.equ SOC_ETM_CH47_TASK_ID_REG,        0x60013194
.equ SOC_ETM_CH48_EVT_ID_REG,         0x60013198
.equ SOC_ETM_CH48_TASK_ID_REG,        0x6001319C
.equ SOC_ETM_CH49_EVT_ID_REG,         0x600131A0
.equ SOC_ETM_CH49_TASK_ID_REG,        0x600131A4
.equ SOC_ETM_CLK_EN_REG,              0x600131A8
# Version Register
.equ SOC_ETM_DATE_REG,                0x600131AC
######################################################

######################################################
# Low-Power Management
# Power Management Unit (PMU)
# Low-power Always-on (LP_AON)
# RTC Timer (RTC_TIMER)
# Low-power Analog Peripheral (LP_ANA_PERI)
# (TRM 403)
######################################################

# PMU Register
# Power Management Unit (PMU)
.equ PMU_BASE,                        0x600B0000
.equ PMU_HP_ACTIVE_DIG_POWER_REG,     0x600B0000
.equ PMU_HP_ACTIVE_ICG_HP_FUNC_REG,   0x600B0004
.equ PMU_HP_ACTIVE_ICG_HP_APB_REG,    0x600B0008
.equ PMU_HP_ACTIVE_HP_SYS_CNTL_REG,   0x600B0010
.equ PMU_HP_ACTIVE_HP_CK_POWER_REG,   0x600B0014
.equ PMU_HP_ACTIVE_BACKUP_REG,        0x600B001C
.equ PMU_HP_ACTIVE_BACKUP_CLK_REG,    0x600B0020
.equ PMU_HP_ACTIVE_SYSCLK_REG,        0x600B0024
.equ PMU_HP_ACTIVE_HP_REGULATOR0_REG, 0x600B0028
.equ PMU_HP_ACTIVE_XTAL_REG,          0x600B0030
.equ PMU_HP_MODEM_DIG_POWER_REG,      0x600B0034
.equ PMU_HP_MODEM_ICG_HP_FUNC_REG,    0x600B0038
.equ PMU_HP_MODEM_ICG_HP_APB_REG,     0x600B003C
.equ PMU_HP_MODEM_HP_SYS_CNTL_REG,    0x600B0044
.equ PMU_HP_MODEM_HP_CK_POWER_REG,    0x600B0048
.equ PMU_HP_MODEM_BACKUP_REG,         0x600B0050
.equ PMU_HP_MODEM_BACKUP_CLK_REG,     0x600B0054
.equ PMU_HP_MODEM_SYSCLK_REG,         0x600B0058
.equ PMU_HP_MODEM_HP_REGULATOR0_REG,  0x600B005C
.equ PMU_HP_MODEM_XTAL_REG,           0x600B0064
.equ PMU_HP_SLEEP_DIG_POWER_REG,      0x600B0068
.equ PMU_HP_SLEEP_ICG_HP_FUNC_REG,    0x600B006C
.equ PMU_HP_SLEEP_ICG_HP_APB_REG,     0x600B0070
.equ PMU_HP_SLEEP_HP_SYS_CNTL_REG,    0x600B0078
.equ PMU_HP_SLEEP_HP_CK_POWER_REG,    0x600B007C
.equ PMU_HP_SLEEP_BACKUP_REG,         0x600B0084
.equ PMU_HP_SLEEP_BACKUP_CLK_REG,     0x600B0088
.equ PMU_HP_SLEEP_SYSCLK_REG,         0x600B008C
.equ PMU_HP_SLEEP_HP_REGULATOR0_REG,  0x600B0090
.equ PMU_HP_SLEEP_XTAL_REG,           0x600B0098
.equ PMU_HP_SLEEP_LP_DIG_POWER_REG,   0x600B00A8
.equ PMU_HP_SLEEP_LP_CK_POWER_REG,    0x600B00AC
.equ PMU_LP_SLEEP_XTAL_REG,           0x600B00BC
.equ PMU_LP_SLEEP_LP_DIG_POWER_REG,   0x600B00C0
.equ PMU_LP_SLEEP_LP_CK_POWER_REG,    0x600B00C4
.equ PMU_POWER_PD_MEM_MASK_REG,       0x600B0110
.equ PMU_POWER_CK_WAIT_CNTL_REG,      0x600B011C
.equ PMU_SLP_WAKEUP_CNTL0_REG,        0x600B0120
.equ PMU_SLP_WAKEUP_CNTL1_REG,        0x600B0124
.equ PMU_SLP_WAKEUP_CNTL2_REG,        0x600B0128
.equ PMU_SLP_WAKEUP_CNTL4_REG,        0x600B0130
.equ PMU_SLP_WAKEUP_STATUS0_REG,      0x600B0140
.equ PMU_SLP_WAKEUP_STATUS1_REG,      0x600B0144
.equ PMU_INT_RAW_REG,                 0x600B015C
.equ PMU_HP_INT_ST_REG,               0x600B0160
.equ PMU_HP_INT_ENA_REG,              0x600B0164
.equ PMU_HP_INT_CLR_REG,              0x600B0168
.equ PMU_LP_INT_RAW_REG,              0x600B016C
.equ PMU_LP_INT_ST_REG,               0x600B0170
.equ PMU_LP_INT_ENA_REG,              0x600B0174
.equ PMU_LP_INT_CLR_REG,              0x600B0178
.equ PMU_LP_CPU_PWR0_REG,             0x600B017C
.equ PMU_LP_CPU_PWR1_REG,             0x600B0180
.equ PMU_HP_LP_CPU_COMM_REG,          0x600B0184
.equ PMU_DATE_REG,                    0x600B03FC

# Low-power Always-on (LP_AON)
.equ LP_AON_BASE,                     0x600B1000
.equ LP_AON_STORE0_REG,               0x600B1000
.equ LP_AON_STORE1_REG,               0x600B1004
.equ LP_AON_STORE2_REG,               0x600B1008
.equ LP_AON_STORE3_REG,               0x600B100C
.equ LP_AON_STORE4_REG,               0x600B1010
.equ LP_AON_STORE5_REG,               0x600B1014
.equ LP_AON_STORE6_REG,               0x600B1018
.equ LP_AON_STORE7_REG,               0x600B101C
.equ LP_AON_STORE8_REG,               0x600B1020
.equ LP_AON_STORE9_REG,               0x600B1024
.equ LP_AON_SYS_CFG_REG,              0x600B1034
.equ LP_AON_CPUCORE0_CFG_REG,         0x600B1038

# RTC Timer (RTC_TIMER)
.equ RTC_TIMER_BASE,                  0x600B0C00
.equ RTC_TIMER_TAR0_LOW_REG,          0x600B0C00
.equ RTC_TIMER_TAR0_HIGH_REG,         0x600B0C04
.equ RTC_TIMER_TAR1_LOW_REG,          0x600B0C08
.equ RTC_TIMER_TAR1_HIGH_REG,         0x600B0C0C
.equ RTC_TIMER_UPDATE_REG,            0x600B0C10
.equ RTC_TIMER_MAIN_BUF0_LOW_REG,     0x600B0C14
.equ RTC_TIMER_MAIN_BUF0_HIGH_REG,    0x600B0C18
.equ RTC_TIMER_MAIN_BUF1_LOW_REG,     0x600B0C1C
.equ RTC_TIMER_MAIN_BUF1_HIGH_REG,    0x600B0C20
.equ RTC_TIMER_INT_RAW_REG,           0x600B0C28
.equ RTC_TIMER_INT_ST_REG,            0x600B0C2C
.equ RTC_TIMER_INT_ENA_REG,           0x600B0C30
.equ RTC_TIMER_INT_CLR_REG,           0x600B0C34
.equ RTC_TIMER_LP_INT_RAW_REG,        0x600B0C38
.equ RTC_TIMER_LP_INT_ST_REG,         0x600B0C3C
.equ RTC_TIMER_LP_INT_ENA_REG,        0x600B0C40
.equ RTC_TIMER_LP_INT_CLR_REG,        0x600B0C44

# Brownout Detector
# Low-power Analog Peripheral (LP_ANA_PERI)
.equ LP_ANA_PERI_BASE,                0x600B2C00
.equ LP_ANA_BOD_MODE0_CNTL_REG,       0x600B2C00
.equ LP_ANA_BOD_MODE1_CNTL_REG,       0x600B2C04
.equ LP_ANA_FIB_ENABLE_REG,           0x600B2C0C
.equ LP_ANA_INT_RAW_REG,              0x600B2C10
.equ LP_ANA_INT_ST_REG,               0x600B2C14
.equ LP_ANA_INT_ENA_REG,              0x600B2C18
.equ LP_ANA_INT_CLR_REG,              0x600B2C1C
.equ LP_ANA_LP_INT_RAW_REG,           0x600B2C20
.equ LP_ANA_LP_INT_ST_REG,            0x600B2C24
.equ LP_ANA_LP_INT_ENA_REG,           0x600B2C28
.equ LP_ANA_LP_INT_CLR_REG,           0x600B2C2C
.equ LP_ANA_DATE_REG,                 0x600B2FFC
######################################################

