codeljo/riscv-bare-metal/esp32c6/include/registers.inc
######################################################
# System Timer (SYSTIMER)
# (TRM 488)
######################################################
.equ SYSTIMER_BASE,                0x6000A000
# Clock Control Register
.equ SYSTIMER_CONF_REG,            0x6000A000
# UNIT0 Control and Configuration Registers
.equ SYSTIMER_UNIT0_OP_REG,        0x6000A004
.equ SYSTIMER_UNIT0_LOAD_HI_REG,   0x6000A00C
.equ SYSTIMER_UNIT0_LOAD_LO_REG,   0x6000A010
.equ SYSTIMER_UNIT0_VALUE_HI_REG,  0x6000A040
.equ SYSTIMER_UNIT0_VALUE_LO_REG,  0x6000A044
.equ SYSTIMER_UNIT0_LOAD_REG,      0x6000A05C
# UNIT1 Control and Configuration Registers
.equ SYSTIMER_UNIT1_OP_REG,        0x6000A008
.equ SYSTIMER_UNIT1_LOAD_HI_REG,   0x6000A014
.equ SYSTIMER_UNIT1_LOAD_LO_REG,   0x6000A018
.equ SYSTIMER_UNIT1_VALUE_HI_REG,  0x6000A048
.equ SYSTIMER_UNIT1_VALUE_LO_REG,  0x6000A04C
.equ SYSTIMER_UNIT1_LOAD_REG,      0x6000A060
# Comparator0 Control and Configuration Registers
.equ SYSTIMER_TARGET0_HI_REG,      0x6000A01C
.equ SYSTIMER_TARGET0_LO_REG,      0x6000A020
.equ SYSTIMER_TARGET0_CONF_REG,    0x6000A034
.equ SYSTIMER_COMP0_LOAD_REG,      0x6000A050
# Comparator1 Control and Configuration Registers
.equ SYSTIMER_TARGET1_HI_REG,      0x6000A024
.equ SYSTIMER_TARGET1_LO_REG,      0x6000A028
.equ SYSTIMER_TARGET1_CONF_REG,    0x6000A038
.equ SYSTIMER_COMP1_LOAD_REG,      0x6000A054
# Comparator2 Control and Configuration Registers
.equ SYSTIMER_TARGET2_HI_REG,      0x6000A02C
.equ SYSTIMER_TARGET2_LO_REG,      0x6000A030
.equ SYSTIMER_TARGET2_CONF_REG,    0x6000A03C
.equ SYSTIMER_COMP2_LOAD_REG,      0x6000A058
# Interrupt Registers
.equ SYSTIMER_INT_ENA_REG,         0x6000A064
.equ SYSTIMER_INT_RAW_REG,         0x6000A068
.equ SYSTIMER_INT_CLR_REG,         0x6000A06C
.equ SYSTIMER_INT_ST_REG,          0x6000A070
# COMP0 Status Registers
.equ SYSTIMER_REAL_TARGET0_LO_REG, 0x6000A074
.equ SYSTIMER_REAL_TARGET0_HI_REG, 0x6000A078
# COMP1 Status Registers
.equ SYSTIMER_REAL_TARGET1_LO_REG, 0x6000A07C
.equ SYSTIMER_REAL_TARGET1_HI_REG, 0x6000A080
# COMP2 Status Registers
.equ SYSTIMER_REAL_TARGET2_LO_REG, 0x6000A084
.equ SYSTIMER_REAL_TARGET2_HI_REG, 0x6000A088
# Version Registers
.equ SYSTIMER_DATE_REG,            0x6000A0FC
######################################################

######################################################
# Timer Group (TIMG)
# (TRM 514) (timer group 0)
# (note: inserted a 0 to the register names)
######################################################
.equ TIMG0_BASE,               0x60008000
# T0 control and configuration registers
.equ TIMG0_T0CONFIG_REG,       0x60008000
.equ TIMG0_T0LO_REG,           0x60008004
.equ TIMG0_T0HI_REG,           0x60008008
.equ TIMG0_T0UPDATE_REG,       0x6000800C
.equ TIMG0_T0ALARMLO_REG,      0x60008010
.equ TIMG0_T0ALARMHI_REG,      0x60008014
.equ TIMG0_T0LOADLO_REG,       0x60008018
.equ TIMG0_T0LOADHI_REG,       0x6000801C
.equ TIMG0_T0LOAD_REG,         0x60008020
# WDT control and configuration registers
.equ TIMG0_WDTCONFIG0_REG,     0x60008048
.equ TIMG0_WDTCONFIG1_REG,     0x6000804C
.equ TIMG0_WDTCONFIG2_REG,     0x60008050
.equ TIMG0_WDTCONFIG3_REG,     0x60008054
.equ TIMG0_WDTCONFIG4_REG,     0x60008058
.equ TIMG0_WDTCONFIG5_REG,     0x6000805C
.equ TIMG0_WDTFEED_REG,        0x60008060
.equ TIMG0_WDTWPROTECT_REG,    0x60008064
# RTC frequency calculation control and configuration registers
.equ TIMG0_RTCCALICFG_REG,     0x60008068
.equ TIMG0_RTCCALICFG1_REG,    0x6000806C
.equ TIMG0_RTCCALICFG2_REG,    0x60008080
# Interrupt registers
.equ TIMG0_INT_ENA_TIMERS_REG, 0x60008070
.equ TIMG0_INT_RAW_TIMERS_REG, 0x60008074
.equ TIMG0_INT_ST_TIMERS_REG,  0x60008078
.equ TIMG0_INT_CLR_TIMERS_REG, 0x6000807C
# Version register
.equ TIMG0_NTIMERS_DATE_REG,   0x600080F8
# Clock configuration registers
.equ TIMG0_REGCLK_REG,         0x600080FC
######################################################

######################################################
# Timer Group (TIMG)
# (TRM 514) (timer group 1)
# (note: inserted a 1 to the register names)
######################################################
.equ TIMG1_BASE,               0x60009000
# T0 control and configuration registers
.equ TIMG1_T0CONFIG_REG,       0x60009000
.equ TIMG1_T0LO_REG,           0x60009004
.equ TIMG1_T0HI_REG,           0x60009008
.equ TIMG1_T0UPDATE_REG,       0x6000900C
.equ TIMG1_T0ALARMLO_REG,      0x60009010
.equ TIMG1_T0ALARMHI_REG,      0x60009014
.equ TIMG1_T0LOADLO_REG,       0x60009018
.equ TIMG1_T0LOADHI_REG,       0x6000901C
.equ TIMG1_T0LOAD_REG,         0x60009020
# WDT control and configuration registers
.equ TIMG1_WDTCONFIG0_REG,     0x60009048
.equ TIMG1_WDTCONFIG1_REG,     0x6000904C
.equ TIMG1_WDTCONFIG2_REG,     0x60009050
.equ TIMG1_WDTCONFIG3_REG,     0x60009054
.equ TIMG1_WDTCONFIG4_REG,     0x60009058
.equ TIMG1_WDTCONFIG5_REG,     0x6000905C
.equ TIMG1_WDTFEED_REG,        0x60009060
.equ TIMG1_WDTWPROTECT_REG,    0x60009064
# RTC frequency calculation control and configuration registers
.equ TIMG1_RTCCALICFG_REG,     0x60009068
.equ TIMG1_RTCCALICFG1_REG,    0x6000906C
.equ TIMG1_RTCCALICFG2_REG,    0x60009080
# Interrupt registers
.equ TIMG1_INT_ENA_TIMERS_REG, 0x60009070
.equ TIMG1_INT_RAW_TIMERS_REG, 0x60009074
.equ TIMG1_INT_ST_TIMERS_REG,  0x60009078
.equ TIMG1_INT_CLR_TIMERS_REG, 0x6000907C
# Version register
.equ TIMG1_NTIMERS_DATE_REG,   0x600090F8
# Clock configuration registers
.equ TIMG1_REGCLK_REG,         0x600090FC
######################################################

######################################################
# Watchdog Timers (WDT)
# (TRM 535)
######################################################
# Configuration Registers
.equ LP_WDT_BASE,                           0x600B1C00
.equ LP_WDT_RWDT_CONFIG0_REG,               0x600B1C00
.equ LP_WDT_RWDT_CONFIG1_REG,               0x600B1C04
.equ LP_WDT_RWDT_CONFIG2_REG,               0x600B1C08
.equ LP_WDT_RWDT_CONFIG3_REG,               0x600B1C0C
.equ LP_WDT_RWDT_CONFIG4_REG,               0x600B1C10
.equ LP_WDT_RWDT_FEED_REG,                  0x600B1C14
.equ LP_WDT_RWDT_WPROTECT_REG,              0x600B1C18
.equ LP_WDT_SWD_CONFIG_REG,                 0x600B1C1C
.equ LP_WDT_SWD_WPROTECT_REG,               0x600B1C20
.equ LP_WDT_INT_RAW_REG,                    0x600B1C24
.equ LP_WDT_INT_ST_REG,                     0x600B1C28
.equ LP_WDT_INT_ENA_REG,                    0x600B1C2C
.equ LP_WDT_INT_CLR_REG,                    0x600B1C30
.equ LP_WDT_DATE_REG,                       0x600B1FFC
######################################################

######################################################
# Permission Control (PMS)
# Access Permission Management Controller (HP_APM)
# Low-Power Access Permission Management  (LP_APM)
# Trusted Execution Environment           (TEE)
# Low-power Trusted Execution Environment (LP_TEE)
# (TRM 544)
######################################################

# Access Permission Management Controller (HP_APM)
# High Performance APM Registers (HP_APM_REG)
.equ HP_APM_BASE,                       0x60099000
.equ HP_APM_REGION_FILTER_EN_REG,       0x60099000
.equ HP_APM_REGION0_ADDR_START_REG,     0x60099004
.equ HP_APM_REGION1_ADDR_START_REG,     0x60099010
.equ HP_APM_REGION2_ADDR_START_REG,     0x6009901C
.equ HP_APM_REGION3_ADDR_START_REG,     0x60099028
.equ HP_APM_REGION4_ADDR_START_REG,     0x60099034
.equ HP_APM_REGION5_ADDR_START_REG,     0x60099040
.equ HP_APM_REGION6_ADDR_START_REG,     0x6009904C
.equ HP_APM_REGION7_ADDR_START_REG,     0x60099058
.equ HP_APM_REGION8_ADDR_START_REG,     0x60099064
.equ HP_APM_REGION9_ADDR_START_REG,     0x60099070
.equ HP_APM_REGION10_ADDR_START_REG,    0x6009907C
.equ HP_APM_REGION11_ADDR_START_REG,    0x60099088
.equ HP_APM_REGION12_ADDR_START_REG,    0x60099094
.equ HP_APM_REGION13_ADDR_START_REG,    0x600990A0
.equ HP_APM_REGION14_ADDR_START_REG,    0x600990AC
.equ HP_APM_REGION15_ADDR_START_REG,    0x600990B8
.equ HP_APM_REGION0_ADDR_END_REG,       0x60099008
.equ HP_APM_REGION1_ADDR_END_REG,       0x60099014
.equ HP_APM_REGION2_ADDR_END_REG,       0x60099020
.equ HP_APM_REGION3_ADDR_END_REG,       0x6009902C
.equ HP_APM_REGION4_ADDR_END_REG,       0x60099038
.equ HP_APM_REGION5_ADDR_END_REG,       0x60099044
.equ HP_APM_REGION6_ADDR_END_REG,       0x60099050
.equ HP_APM_REGION7_ADDR_END_REG,       0x6009905C
.equ HP_APM_REGION8_ADDR_END_REG,       0x60099068
.equ HP_APM_REGION9_ADDR_END_REG,       0x60099074
.equ HP_APM_REGION10_ADDR_END_REG,      0x60099080
.equ HP_APM_REGION11_ADDR_END_REG,      0x6009908C
.equ HP_APM_REGION12_ADDR_END_REG,      0x60099098
.equ HP_APM_REGION13_ADDR_END_REG,      0x600990A4
.equ HP_APM_REGION14_ADDR_END_REG,      0x600990B0
.equ HP_APM_REGION15_ADDR_END_REG,      0x600990BC
.equ HP_APM_REGION0_ATTR_REG,           0x6009900C
.equ HP_APM_REGION1_ATTR_REG,           0x60099018
.equ HP_APM_REGION2_ATTR_REG,           0x60099024
.equ HP_APM_REGION3_ATTR_REG,           0x60099030
.equ HP_APM_REGION4_ATTR_REG,           0x6009903C
.equ HP_APM_REGION5_ATTR_REG,           0x60099048
.equ HP_APM_REGION6_ATTR_REG,           0x60099054
.equ HP_APM_REGION7_ATTR_REG,           0x60099060
.equ HP_APM_REGION8_ATTR_REG,           0x6009906C
.equ HP_APM_REGION9_ATTR_REG,           0x60099078
.equ HP_APM_REGION10_ATTR_REG,          0x60099084
.equ HP_APM_REGION11_ATTR_REG,          0x60099090
.equ HP_APM_REGION12_ATTR_REG,          0x6009909C
.equ HP_APM_REGION13_ATTR_REG,          0x600990A8
.equ HP_APM_REGION14_ATTR_REG,          0x600990B4
.equ HP_APM_REGION15_ATTR_REG,          0x600990C0
.equ HP_APM_FUNC_CTRL_REG,              0x600990C4
.equ HP_APM_M0_STATUS_REG,              0x600990C8
.equ HP_APM_M0_STATUS_CLR_REG,          0x600990CC
.equ HP_APM_M0_EXCEPTION_INFO0_REG,     0x600990D0
.equ HP_APM_M0_EXCEPTION_INFO1_REG,     0x600990D4
.equ HP_APM_M1_STATUS_REG,              0x600990D8
.equ HP_APM_M1_STATUS_CLR_REG,          0x600990DC
.equ HP_APM_M1_EXCEPTION_INFO0_REG,     0x600990E0
.equ HP_APM_M1_EXCEPTION_INFO1_REG,     0x600990E4
.equ HP_APM_M2_STATUS_REG,              0x600990E8
.equ HP_APM_M2_STATUS_CLR_REG,          0x600990EC
.equ HP_APM_M2_EXCEPTION_INFO0_REG,     0x600990F0
.equ HP_APM_M2_EXCEPTION_INFO1_REG,     0x600990F4
.equ HP_APM_M3_STATUS_REG,              0x600990F8
.equ HP_APM_M3_STATUS_CLR_REG,          0x600990FC
.equ HP_APM_M3_EXCEPTION_INFO0_REG,     0x60099100
.equ HP_APM_M3_EXCEPTION_INFO1_REG,     0x60099104
.equ HP_APM_INT_EN_REG,                 0x60099108
.equ HP_APM_CLOCK_GATE_REG,             0x6009910C
.equ HP_APM_DATE_REG,                   0x600997FC


# Low-Power Access Permission Management (LP_APM)
.equ LP_APM_BASE,                       0x600B3800
.equ LP_APM_REGION_FILTER_EN_REG,       0x600B3800
.equ LP_APM_REGION0_ADDR_START_REG,     0x600B3804
.equ LP_APM_REGION1_ADDR_START_REG,     0x600B3810
.equ LP_APM_REGION2_ADDR_START_REG,     0x600B381C
.equ LP_APM_REGION3_ADDR_START_REG,     0x600B3828
.equ LP_APM_REGION0_ADDR_END_REG,       0x600B3808
.equ LP_APM_REGION1_ADDR_END_REG,       0x600B3814
.equ LP_APM_REGION2_ADDR_END_REG,       0x600B3820
.equ LP_APM_REGION3_ADDR_END_REG,       0x600B382C
.equ LP_APM_REGION0_ATTR_REG,           0x600B380C
.equ LP_APM_REGION1_ATTR_REG,           0x600B3818
.equ LP_APM_REGION2_ATTR_REG,           0x600B3824
.equ LP_APM_REGION3_ATTR_REG,           0x600B3830
.equ LP_APM_FUNC_CTRL_REG,              0x600B38C4
.equ LP_APM_M0_STATUS_REG,              0x600B38C8
.equ LP_APM_M0_STATUS_CLR_REG,          0x600B38CC
.equ LP_APM_M0_EXCEPTION_INFO0_REG,     0x600B38D0
.equ LP_APM_M0_EXCEPTION_INFO1_REG,     0x600B38D4
.equ LP_APM_M1_STATUS_REG,              0x600B38D8
.equ LP_APM_M1_STATUS_CLR_REG,          0x600B38DC
.equ LP_APM_M1_EXCEPTION_INFO0_REG,     0x600B38E0
.equ LP_APM_M1_EXCEPTION_INFO1_REG,     0x600B38E4
.equ LP_APM_INT_EN_REG,                 0x600B38E8
.equ LP_APM_CLOCK_GATE_REG,             0x600B38EC
.equ LP_APM_DATE_REG,                   0x600B38FC


# Low Power APM0 Registers (LP_APM0_REG)
.equ LP_APM0_BASE,                      0x6009A000
.equ LP_APM0_REGION_FILTER_EN_REG,      0x6009A000
.equ LP_APM0_REGION0_ADDR_START_REG,    0x6009A004
.equ LP_APM0_REGION1_ADDR_START_REG,    0x6009A010
.equ LP_APM0_REGION2_ADDR_START_REG,    0x6009A01C
.equ LP_APM0_REGION3_ADDR_START_REG,    0x6009A028
.equ LP_APM0_REGION0_ADDR_END_REG,      0x6009A008
.equ LP_APM0_REGION1_ADDR_END_REG,      0x6009A014
.equ LP_APM0_REGION2_ADDR_END_REG,      0x6009A020
.equ LP_APM0_REGION3_ADDR_END_REG,      0x6009A02C
.equ LP_APM0_REGION0_ATTR_REG,          0x6009A00C
.equ LP_APM0_REGION1_ATTR_REG,          0x6009A018
.equ LP_APM0_REGION2_ATTR_REG,          0x6009A024
.equ LP_APM0_REGION3_ATTR_REG,          0x6009A030
.equ LP_APM0_FUNC_CTRL_REG,             0x6009A0C4
.equ LP_APM0_M0_STATUS_REG,             0x6009A0C8
.equ LP_APM0_M0_STATUS_CLR_REG,         0x6009A0CC
.equ LP_APM0_M0_EXCEPTION_INFO0_REG,    0x6009A0D0
.equ LP_APM0_M0_EXCEPTION_INFO1_REG,    0x6009A0D4
.equ LP_APM0_INT_EN_REG,                0x6009A0D8
.equ LP_APM0_CLOCK_GATE_REG,            0x6009A0DC
.equ LP_APM0_DATE_REG,                  0x6009A7FC


# High Performance TEE Registers (TEE)
# Trusted Execution Environment (TEE)
.equ TEE_BASE,                0x60098000
.equ TEE_M0_MODE_CTRL_REG,    0x60098000
.equ TEE_M1_MODE_CTRL_REG,    0x60098004
.equ TEE_M2_MODE_CTRL_REG,    0x60098008
.equ TEE_M3_MODE_CTRL_REG,    0x6009800C
.equ TEE_M4_MODE_CTRL_REG,    0x60098010
.equ TEE_M5_MODE_CTRL_REG,    0x60098014
.equ TEE_M6_MODE_CTRL_REG,    0x60098018
.equ TEE_M7_MODE_CTRL_REG,    0x6009801C
.equ TEE_M8_MODE_CTRL_REG,    0x60098020
.equ TEE_M9_MODE_CTRL_REG,    0x60098024
.equ TEE_M10_MODE_CTRL_REG,   0x60098028
.equ TEE_M11_MODE_CTRL_REG,   0x6009802C
.equ TEE_M12_MODE_CTRL_REG,   0x60098030
.equ TEE_M13_MODE_CTRL_REG,   0x60098034
.equ TEE_M14_MODE_CTRL_REG,   0x60098038
.equ TEE_M15_MODE_CTRL_REG,   0x6009803C
.equ TEE_M16_MODE_CTRL_REG,   0x60098040
.equ TEE_M17_MODE_CTRL_REG,   0x60098044
.equ TEE_M18_MODE_CTRL_REG,   0x60098048
.equ TEE_M19_MODE_CTRL_REG,   0x6009804C
.equ TEE_M20_MODE_CTRL_REG,   0x60098050
.equ TEE_M21_MODE_CTRL_REG,   0x60098054
.equ TEE_M22_MODE_CTRL_REG,   0x60098058
.equ TEE_M23_MODE_CTRL_REG,   0x6009805C
.equ TEE_M24_MODE_CTRL_REG,   0x60098060
.equ TEE_M25_MODE_CTRL_REG,   0x60098064
.equ TEE_M26_MODE_CTRL_REG,   0x60098068
.equ TEE_M27_MODE_CTRL_REG,   0x6009806C
.equ TEE_M28_MODE_CTRL_REG,   0x60098070
.equ TEE_M29_MODE_CTRL_REG,   0x60098074
.equ TEE_M30_MODE_CTRL_REG,   0x60098078
.equ TEE_M31_MODE_CTRL_REG,   0x6009807C
.equ TEE_CLOCK_GATE_REG,      0x60098080
.equ TEE_DATE_REG,            0x60098FFC


