codeljo/riscv-bare-metal/esp32c6/include/registers.inc
# Low Power TEE Registers (LP_TEE)
# Low-power Trusted Execution Environment (LP_TEE)
.equ LP_TEE_BASE,             0x600B3400
.equ LP_TEE_M0_MODE_CTRL_REG, 0x600B3400
.equ LP_TEE_CLOCK_GATE_REG,   0x600B3404
.equ LP_TEE_FORCE_ACC_HP_REG, 0x600B3490
.equ LP_TEE_DATE_REG,         0x600B34FC
######################################################

######################################################
# HP System Registers (HP_SYSREG)
# (TRM 580)
######################################################
.equ HP_SYSREG_BASE,                         0x60095000
.equ HP_SYSTEM_EXTERNAL_DEVICE_ENCRYPT_DECRYPT_CONTROL_REG, 0x60095000
.equ HP_SYSTEM_SEC_DPA_CONF_REG,             0x60095008
.equ HP_SYSTEM_CORE_DEBUG_RUNSTALL_CONF_REG, 0x60095040
.equ HP_SYSTEM_CPU_PERI_TIMEOUT_CONF_REG,    0x6009500C
.equ HP_SYSTEM_CPU_PERI_TIMEOUT_ADDR_REG,    0x60095010
.equ HP_SYSTEM_CPU_PERI_TIMEOUT_UID_REG,     0x60095014
.equ HP_SYSTEM_HP_PERI_TIMEOUT_CONF_REG,     0x60095018
.equ HP_SYSTEM_HP_PERI_TIMEOUT_ADDR_REG,     0x6009501C
.equ HP_SYSTEM_HP_PERI_TIMEOUT_UID_REG,      0x60095020
.equ HP_SYSTEM_DATE_REG,                     0x600953FC

#.equ LP_PERI_BUS_TIMEOUT_CONF_REG,           0x00000000
#.equ LP_PERI_BUS_TIMEOUT_ADDR_REG,           0x00000000
#.equ LP_PERI_BUS_TIMEOUT_UID_REG,            0x00000000
######################################################

######################################################
# Debug Assistant (ASSIST_DEBUG)
# (TRM 588)
######################################################
.equ ASSIST_DEBUG_BASE,                          0x600C2000
# Monitor configuration registers
.equ ASSIST_DEBUG_CORE_0_MONTR_ENA_REG,          0x600C2000
.equ ASSIST_DEBUG_CORE_0_AREA_DRAM0_0_MIN_REG,   0x600C2010
.equ ASSIST_DEBUG_CORE_0_AREA_DRAM0_0_MAX_REG,   0x600C2014
.equ ASSIST_DEBUG_CORE_0_AREA_DRAM0_1_MIN_REG,   0x600C2018
.equ ASSIST_DEBUG_CORE_0_AREA_DRAM0_1_MAX_REG,   0x600C201C
.equ ASSIST_DEBUG_CORE_0_AREA_PIF_0_MIN_REG,     0x600C2020
.equ ASSIST_DEBUG_CORE_0_AREA_PIF_0_MAX_REG,     0x600C2024
.equ ASSIST_DEBUG_CORE_0_AREA_PIF_1_MIN_REG,     0x600C2028
.equ ASSIST_DEBUG_CORE_0_AREA_PIF_1_MAX_REG,     0x600C202C
.equ ASSIST_DEBUG_CORE_0_AREA_PC_REG,            0x600C2030
.equ ASSIST_DEBUG_CORE_0_AREA_SP_REG,            0x600C2034
.equ ASSIST_DEBUG_CORE_0_SP_MIN_REG,             0x600C2038
.equ ASSIST_DEBUG_CORE_0_SP_MAX_REG,             0x600C203C
.equ ASSIST_DEBUG_CORE_0_SP_PC_REG,              0x600C2040
# Interrupt configuration registers
.equ ASSIST_DEBUG_CORE_0_INTR_RAW_REG,           0x600C2004
.equ ASSIST_DEBUG_CORE_0_INTR_ENA_REG,           0x600C2008
.equ ASSIST_DEBUG_CORE_0_INTR_CLR_REG,           0x600C200C
# PC logging configuration register
.equ ASSIST_DEBUG_CORE_0_RCD_EN_REG,             0x600C2044
# PC logging status registers
.equ ASSIST_DEBUG_CORE_0_RCD_PDEBUGPC_REG,       0x600C2048
.equ ASSIST_DEBUG_CORE_0_RCD_PDEBUGSP_REG,       0x600C204C
# CPU Status Registers
.equ ASSIST_DEBUG_CORE_0_LASTPC_BEFORE_EXCEPTION_REG, 0x600C2070
.equ ASSIST_DEBUG_CORE_0_DEBUG_MODE_REG,         0x600C2074
# Clock control register
.equ ASSIST_DEBUG_CLOCK_GATE_REG,                0x600C2078
# Version Register
.equ ASSIST_DEBUG_DATE_REG,                      0x600C23FC
######################################################

######################################################
# AES Accelerator (AES)
# (TRM 620)
######################################################
.equ AES_BASE,                0x60088000
# Key Registers
.equ AES_KEY_0_REG,           0x60088000
.equ AES_KEY_1_REG,           0x60088004
.equ AES_KEY_2_REG,           0x60088008
.equ AES_KEY_3_REG,           0x6008800C
.equ AES_KEY_4_REG,           0x60088010
.equ AES_KEY_5_REG,           0x60088014
.equ AES_KEY_6_REG,           0x60088018
.equ AES_KEY_7_REG,           0x6008801C
# TEXT_IN Registers
.equ AES_TEXT_IN_0_REG,       0x60088020
.equ AES_TEXT_IN_1_REG,       0x60088024
.equ AES_TEXT_IN_2_REG,       0x60088028
.equ AES_TEXT_IN_3_REG,       0x6008802C
# TEXT_OUT Registers
.equ AES_TEXT_OUT_0_REG,      0x60088030
.equ AES_TEXT_OUT_1_REG,      0x60088034
.equ AES_TEXT_OUT_2_REG,      0x60088038
.equ AES_TEXT_OUT_3_REG,      0x6008803C
# Control / Configuration Registers
.equ AES_MODE_REG,            0x60088040
.equ AES_DMA_ENABLE_REG,      0x60088090
.equ AES_BLOCK_MODE_REG,      0x60088094
.equ AES_BLOCK_NUM_REG,       0x60088098
.equ AES_INC_SEL_REG,         0x6008809C
.equ AES_TRIGGER_REG,         0x60088048
.equ AES_DMA_EXIT_REG,        0x600880B8
# Status Registers 
.equ AES_STATE_REG,           0x6008804C
# Interrupt Registers
.equ AES_INT_CLR_REG,         0x600880AC
.equ AES_INT_ENA_REG,         0x600880B0
######################################################

######################################################
# ECC Accelerator (ECC)
# (TRM 635)
######################################################
.equ ECC_BASE,                0x6008B000
# Interrupt Registers
.equ ECC_MULT_INT_RAW_REG,    0x6008B00C
.equ ECC_MULT_INT_ST_REG,     0x6008B010
.equ ECC_MULT_INT_ENA_REG,    0x6008B014
.equ ECC_MULT_INT_CLR_REG,    0x6008B018
# Configuration Register
.equ ECC_MULT_CONF_REG,       0x6008B01C
# Version Register
.equ ECC_MULT_DATE_REG,       0x6008B0FC
######################################################

######################################################
# HMAC Accelerator (HMAC)
# (TRM 646)
######################################################
.equ HMAC_BASE,                     0x6008D000
# Control/Status Registers
.equ HMAC_SET_START_REG,            0x6008D040
.equ HMAC_SET_PARA_FINISH_REG,      0x6008D04C
.equ HMAC_SET_MESSAGE_ONE_REG,      0x6008D050
.equ HMAC_SET_MESSAGE_ING_REG,      0x6008D054
.equ HMAC_SET_MESSAGE_END_REG,      0x6008D058
.equ HMAC_SET_RESULT_FINISH_REG,    0x6008D05C
.equ HMAC_SET_INVALIDATE_JTAG_REG,  0x6008D060
.equ HMAC_SET_INVALIDATE_DS_REG,    0x6008D064
.equ HMAC_QUERY_ERROR_REG,          0x6008D068
.equ HMAC_QUERY_BUSY_REG,           0x6008D06C
.equ HMAC_SET_MESSAGE_PAD_REG,      0x6008D0F0
.equ HMAC_ONE_BLOCK_REG,            0x6008D0F4
# Configuration Registers
.equ HMAC_SET_PARA_PURPOSE_REG,     0x6008D044
.equ HMAC_SET_PARA_KEY_REG,         0x6008D048
.equ HMAC_SOFT_JTAG_CTRL_REG,       0x6008D0F8
.equ HMAC_WR_JTAG_REG,              0x6008D0FC
# HMAC Message Block
.equ HMAC_WR_MESSAGE_0_REG,         0x6008D080
.equ HMAC_WR_MESSAGE_1_REG,         0x6008D084
.equ HMAC_WR_MESSAGE_2_REG,         0x6008D088
.equ HMAC_WR_MESSAGE_3_REG,         0x6008D08C
.equ HMAC_WR_MESSAGE_4_REG,         0x6008D090
.equ HMAC_WR_MESSAGE_5_REG,         0x6008D094
.equ HMAC_WR_MESSAGE_6_REG,         0x6008D098
.equ HMAC_WR_MESSAGE_7_REG,         0x6008D09C
.equ HMAC_WR_MESSAGE_8_REG,         0x6008D0A0
.equ HMAC_WR_MESSAGE_9_REG,         0x6008D0A4
.equ HMAC_WR_MESSAGE_10_REG,        0x6008D0A8
.equ HMAC_WR_MESSAGE_11_REG,        0x6008D0AC
.equ HMAC_WR_MESSAGE_12_REG,        0x6008D0B0
.equ HMAC_WR_MESSAGE_13_REG,        0x6008D0B4
.equ HMAC_WR_MESSAGE_14_REG,        0x6008D0B8
.equ HMAC_WR_MESSAGE_15_REG,        0x6008D0BC
# HMAC Upstream Result
.equ HMAC_RD_RESULT_0_REG,          0x6008D0C0
.equ HMAC_RD_RESULT_1_REG,          0x6008D0C4
.equ HMAC_RD_RESULT_2_REG,          0x6008D0C8
.equ HMAC_RD_RESULT_3_REG,          0x6008D0CC
.equ HMAC_RD_RESULT_4_REG,          0x6008D0D0
.equ HMAC_RD_RESULT_5_REG,          0x6008D0D4
.equ HMAC_RD_RESULT_6_REG,          0x6008D0D8
.equ HMAC_RD_RESULT_7_REG,          0x6008D0DC
# Version Register
.equ HMAC_DATE_REG,                 0x6008D0F8
######################################################

######################################################
# RSA Accelerator (RSA)
# (TRM 662)
######################################################
.equ RSA_BASE,                  0x6008A000
# Control / Configuration Registers
.equ RSA_M_PRIME_REG,           0x6008A800
.equ RSA_MODE_REG,              0x6008A804
.equ RSA_SET_START_MODEXP_REG,  0x6008A80C
.equ RSA_SET_START_MODMULT_REG, 0x6008A810
.equ RSA_SET_START_MULT_REG,    0x6008A814
.equ RSA_QUERY_IDLE_REG,        0x6008A818
.equ RSA_CONSTANT_TIME_REG,     0x6008A820
.equ RSA_SEARCH_ENABLE_REG,     0x6008A824
.equ RSA_SEARCH_POS_REG,        0x6008A828
# Status Register
.equ RSA_QUERY_CLEAN_REG,       0x6008A808
# Interrupt Registers
.equ RSA_INT_CLEAR_REG,         0x6008A81C
.equ RSA_INT_ENA_REG,           0x6008A82C
# Version Register
.equ RSA_DATE_REG,              0x6008A830
######################################################

######################################################
# SHA Accelerator (SHA)
# (TRM 672)
######################################################
.equ SHA_BASE,                 0x60089000
# Control / Configuration registers
.equ SHA_MODE_REG,             0x60089000
.equ SHA_CONTINUE_REG,         0x60089014
.equ SHA_DMA_START_REG,        0x6008901C
.equ SHA_START_REG,            0x60089010
.equ SHA_DMA_CONTINUE_REG,     0x60089020
.equ SHA_DMA_BLOCK_NUM_REG,    0x6008900C
# Status Registers
.equ SHA_BUSY_REG,             0x60089018
# Interrupt Registers
.equ SHA_CLEAR_IRQ_REG,        0x60089024
.equ SHA_IRQ_ENA_REG,          0x60089028
# Data Registers
.equ SHA_H_0_REG,              0x60089040
.equ SHA_H_1_REG,              0x60089044
.equ SHA_H_2_REG,              0x60089048
.equ SHA_H_3_REG,              0x6008904C
.equ SHA_H_4_REG,              0x60089050
.equ SHA_H_5_REG,              0x60089054
.equ SHA_H_6_REG,              0x60089058
.equ SHA_H_7_REG,              0x6008905C
.equ SHA_M_0_REG,              0x60089080
.equ SHA_M_1_REG,              0x60089084
.equ SHA_M_2_REG,              0x60089088
.equ SHA_M_3_REG,              0x6008908C
.equ SHA_M_4_REG,              0x60089090
.equ SHA_M_5_REG,              0x60089094
.equ SHA_M_6_REG,              0x60089098
.equ SHA_M_7_REG,              0x6008909C
.equ SHA_M_8_REG,              0x600890A0
.equ SHA_M_9_REG,              0x600890A4
.equ SHA_M_10_REG,             0x600890A8
.equ SHA_M_11_REG,             0x600890AC
.equ SHA_M_12_REG,             0x600890B0
.equ SHA_M_13_REG,             0x600890B4
.equ SHA_M_14_REG,             0x600890B8
.equ SHA_M_15_REG,             0x600890BC
# Version Register
.equ SHA_DATE_REG,             0x6008902C
######################################################

######################################################
# Digital Signature (DS)
# (TRM 683)
######################################################
.equ DS_BASE,                 0x6008C000
# Configuration Registers
.equ DS_IV_0_REG,             0x6008C630
.equ DS_IV_1_REG,             0x6008C634
.equ DS_IV_2_REG,             0x6008C638
.equ DS_IV_3_REG,             0x6008C63C
# Status/Control Registers
.equ DS_SET_START_REG,        0x6008CE00
.equ DS_SET_ME_REG,           0x6008CE04
.equ DS_SET_FINISH_REG,       0x6008CE08
.equ DS_QUERY_BUSY_REG,       0x6008CE0C
.equ DS_QUERY_KEY_WRONG_REG,  0x6008CE10
.equ DS_QUERY_CHECK_REG,      0x6008CE14
# Version Control Register
.equ DS_DATE_REG,             0x6008CE20
######################################################

######################################################
# External Memory Encryption and Decryption (XTS_AES)
# (TRM 693)
######################################################
.equ XTS_AES_BASE,            0x60002000
# Plaintext Register Heap
.equ XTS_AES_PLAIN_0_REG,     0x60002300
.equ XTS_AES_PLAIN_1_REG,     0x60002304
.equ XTS_AES_PLAIN_2_REG,     0x60002308
.equ XTS_AES_PLAIN_3_REG,     0x6000230C
.equ XTS_AES_PLAIN_4_REG,     0x60002310
.equ XTS_AES_PLAIN_5_REG,     0x60002314
.equ XTS_AES_PLAIN_6_REG,     0x60002318
.equ XTS_AES_PLAIN_7_REG,     0x6000231C
.equ XTS_AES_PLAIN_8_REG,     0x60002320
.equ XTS_AES_PLAIN_9_REG,     0x60002324
.equ XTS_AES_PLAIN_10_REG,    0x60002328
.equ XTS_AES_PLAIN_11_REG,    0x6000232C
.equ XTS_AES_PLAIN_12_REG,    0x60002330
.equ XTS_AES_PLAIN_13_REG,    0x60002334
.equ XTS_AES_PLAIN_14_REG,    0x60002338
.equ XTS_AES_PLAIN_15_REG,    0x6000233C
# Configuration Registers
.equ XTS_AES_LINESIZE_REG,    0x60002340
.equ XTS_AES_DESTINATION_REG, 0x60002344
.equ XTS_AES_PHYSICAL_ADDRESS_REG, 0x60002348
.equ XTS_AES_DPA_CTRL_REG,    0x60002388
# Control/Status Registers
.equ XTS_AES_TRIGGER_REG,     0x6000234C
.equ XTS_AES_RELEASE_REG,     0x60002350
.equ XTS_AES_DESTROY_REG,     0x60002354
.equ XTS_AES_STATE_REG,       0x60002358
# Version Register
.equ XTS_AES_DATE_REG,        0x6000235C
######################################################

######################################################
# Random Number Generator (RNG)
# (TRM 705)
######################################################
.equ LPPERI_RNG_DATA_REG,     0x600B2808
######################################################

######################################################
# UART Controller (UART, LP_UART, UHCI)
# (TRM 707)
######################################################
.equ UART0_BASE,                    0x60000000
.equ UART1_BASE,                    0x60001000
# FIFO Configuration
.equ UART0_FIFO_REG,                0x60000000
.equ UART0_TOUT_CONF_SYNC_REG,      0x60000064
# Interrupt Register
.equ UART0_INT_RAW_REG,             0x60000004
.equ UART0_INT_ST_REG,              0x60000008
.equ UART0_INT_ENA_REG,             0x6000000C
.equ UART0_INT_CLR_REG,             0x60000010
# Configuration Registers
.equ UART0_CLKDIV_SYNC_REG,         0x60000014
.equ UART0_RX_FILT_REG,             0x60000018
.equ UART0_CONF0_SYNC_REG,          0x60000020
.equ UART0_CONF1_REG,               0x60000024
.equ UART0_HWFC_CONF_SYNC_REG,      0x6000002C
.equ UART0_SLEEP_CONF0_REG,         0x60000030
.equ UART0_SLEEP_CONF1_REG,         0x60000034
.equ UART0_SLEEP_CONF2_REG,         0x60000038
.equ UART0_SWFC_CONF0_SYNC_REG,     0x6000003C
.equ UART0_SWFC_CONF1_REG,          0x60000040
.equ UART0_TXBRK_CONF_SYNC_REG,     0x60000044
.equ UART0_IDLE_CONF_SYNC_REG,      0x60000048
.equ UART0_RS485_CONF_SYNC_REG,     0x6000004C
.equ UART0_CLK_CONF_REG,            0x60000088
.equ UART0_REG_UPDATE_REG,          0x60000098
.equ UART0_ID_REG,                  0x6000009C
# Status Register
.equ UART0_STATUS_REG,              0x6000001C
.equ UART0_MEM_TX_STATUS_REG,       0x60000068
.equ UART0_MEM_RX_STATUS_REG,       0x6000006C
.equ UART0_FSM_STATUS_REG,          0x60000070
.equ UART0_AFIFI_STATUS_REG,        0x60000090
# AT Escape Sequence Selection Configuration
.equ UART0_AT_CMD_PRECNT_SYNC_REG,  0x60000050
.equ UART0_AT_CMD_POSTCNT_SYNC_REG, 0x60000054
.equ UART0_AT_CMD_GAPTCNT_SYNC_REG, 0x60000058
.equ UART0_AT_CMD_CHAR_SYNC_REG,    0x6000005C
# Autobaud Register
.equ UART0_POSPULSE_REG,            0x60000074
.equ UART0_NEGPULSE_REG,            0x60000078
.equ UART0_LOWPULSE_REG,            0x6000007C
.equ UART0_HIGHPULSE_REG,           0x60000080
.equ UART0_RXD_CNT_REG,             0x60000084
# Version Register
.equ UART0_DATE_REG,                0x6000008C


# Low-power UART (LP_UART)
.equ LP_UART_BASE,                    0x600B1400
# FIFO Configuration
.equ LP_UART_FIFO_REG,                0x600B1400
.equ LP_UART_TOUT_CONF_SYNC_REG,      0x600B1464
# LP UART Interrupt Register
.equ LP_UART_INT_RAW_REG,             0x600B1404
.equ LP_UART_INT_ST_REG,              0x600B1408
.equ LP_UART_INT_ENA_REG,             0x600B140C
.equ LP_UART_INT_CLR_REG,             0x600B1410
# Configuration Register
.equ LP_UART_CLKDIV_SYNC_REG,         0x600B1414
.equ LP_UART_RX_FILT_REG,             0x600B1418
.equ LP_UART_CONF0_SYNC_REG,          0x600B1420
.equ LP_UART_CONF1_REG,               0x600B1424
.equ LP_UART_HWFC_CONF_SYNC_REG,      0x600B142C
.equ LP_UART_SLEEP_CONF0_REG,         0x600B1430
.equ LP_UART_SLEEP_CONF1_REG,         0x600B1434
.equ LP_UART_SLEEP_CONF2_REG,         0x600B1438
.equ LP_UART_SWFC_CONF0_SYNC_REG,     0x600B143C
.equ LP_UART_SWFC_CONF1_REG,          0x600B1440
.equ LP_UART_TXBRK_CONF_SYNC_REG,     0x600B1444
.equ LP_UART_IDLE_CONF_SYNC_REG,      0x600B1448
.equ LP_UART_DELAY_CONF_SYNC_REG,     0x600B144C
.equ LP_UART_CLK_CONF_REG,            0x600B1488
.equ LP_UART_REG_UPDATE_REG,          0x600B1498
.equ LP_UART_ID_REG,                  0x600B149C
# Status Register
.equ LP_UART_STATUS_REG,              0x600B141C
.equ LP_UART_MEM_TX_STATUS_REG,       0x600B1468
.equ LP_UART_MEM_RX_STATUS_REG,       0x600B146C
.equ LP_UART_FSM_STATUS_REG,          0x600B1470
.equ LP_UART_AFIFO_STATUS_REG,        0x600B1490
# AT Escape Sequence Selection Configuration
.equ LP_UART_AT_CMD_PRECNT_SYNC_REG,  0x600B1450
.equ LP_UART_AT_CMD_POSTCNT_SYNC_REG, 0x600B1454
.equ LP_UART_AT_CMD_GAPTOUT_SYNC_REG, 0x600B1458
.equ LP_UART_AT_CMD_CHAR_SYNC_REG,    0x600B145C
# Version Register
.equ LP_UART_DATE_REG,                0x600B148C


# UHCI Controller (UHCI)
.equ UHCI_BASE,                     0x60005000
# Configuration Registers
.equ UHCI_CONF0_REG,                0x60005000
.equ UHCI_CONF1_REG,                0x60005014
.equ UHCI_ESCAPE_CONF_REG,          0x60005020
.equ UHCI_HUNG_CONF_REG,            0x60005024
.equ UHCI_ACK_NUM_REG,              0x60005028
.equ UHCI_QUICK_SENT_REG,           0x60005030
.equ UHCI_REG_Q0_WORD0_REG,         0x60005034
.equ UHCI_REG_Q0_WORD1_REG,         0x60005038
.equ UHCI_REG_Q1_WORD0_REG,         0x6000503C
.equ UHCI_REG_Q1_WORD1_REG,         0x60005040
.equ UHCI_REG_Q2_WORD0_REG,         0x60005044
.equ UHCI_REG_Q2_WORD1_REG,         0x60005048
.equ UHCI_REG_Q3_WORD0_REG,         0x6000504C
.equ UHCI_REG_Q3_WORD1_REG,         0x60005050
.equ UHCI_REG_Q4_WORD0_REG,         0x60005054
.equ UHCI_REG_Q4_WORD1_REG,         0x60005058
.equ UHCI_REG_Q5_WORD0_REG,         0x6000505C
.equ UHCI_REG_Q5_WORD1_REG,         0x60005060
.equ UHCI_REG_Q6_WORD0_REG,         0x60005064
.equ UHCI_REG_Q6_WORD1_REG,         0x60005068
.equ UHCI_ESC_CONF0_REG,            0x6000506C
.equ UHCI_ESC_CONF1_REG,            0x60005070
.equ UHCI_ESC_CONF2_REG,            0x60005074
.equ UHCI_ESC_CONF3_REG,            0x60005078
.equ UHCI_PKT_THRES_REG,            0x6000507C
# Interrupt Registers
.equ UHCI_INT_RAW_REG,              0x60005004
.equ UHCI_INT_ST_REG,               0x60005008
.equ UHCI_INT_ENA_REG,              0x6000500C
.equ UHCI_INT_CLR_REG,              0x60005010
# Status Registers
.equ UHCI_STATE0_REG,               0x60005018
.equ UHCI_STATE1_REG,               0x6000501C
.equ UHCI_RX_HEAD_REG,              0x6000502C
# Version Register
.equ UHCI_DATE_REG,                 0x60005080
######################################################

######################################################
# SPI Controller (SPI)
# (TRM 793)
######################################################
.equ SPI2_BASE,               0x60081000
# User-defined control registers
.equ SPI2_CMD_REG,            0x60081000
.equ SPI2_ADDR_REG,           0x60081004
.equ SPI2_USER_REG,           0x60081010
.equ SPI2_USER1_REG,          0x60081014
.equ SPI2_USER2_REG,          0x60081018
# Control and configuration registers
.equ SPI2_CTRL_REG,           0x60081008
.equ SPI2_MS_DLEN_REG,        0x6008101C
.equ SPI2_MISC_REG,           0x60081020
.equ SPI2_DMA_CONF_REG,       0x60081030
.equ SPI2_SLAVE_REG,          0x600810E0
.equ SPI2_SLAVE1_REG,         0x600810E4
# Clock control registers
.equ SPI2_CLOCK_REG,          0x6008100C
.equ SPI2_CLK_GATE_REG,       0x600810E8
# Timing registers
.equ SPI2_DIN_MODE_REG,       0x60081024
.equ SPI2_DIN_NUM_REG,        0x60081028
.equ SPI2_DOUT_MODE_REG,      0x6008102C
# Interrupt registers
.equ SPI2_DMA_INT_ENA_REG,    0x60081034
.equ SPI2_DMA_INT_CLR_REG,    0x60081038
.equ SPI2_DMA_INT_RAW_REG,    0x6008103C
.equ SPI2_DMA_INT_ST_REG,     0x60081040
.equ SPI2_DMA_INT_SET_REG,    0x60081044
# CPU-controlled data buffer
.equ SPI2_W0_REG,             0x60081098
.equ SPI2_W1_REG,             0x6008109C
.equ SPI2_W2_REG,             0x600810A0
.equ SPI2_W3_REG,             0x600810A4
.equ SPI2_W4_REG,             0x600810A8
.equ SPI2_W5_REG,             0x600810AC
.equ SPI2_W6_REG,             0x600810B0
.equ SPI2_W7_REG,             0x600810B4
.equ SPI2_W8_REG,             0x600810B8
.equ SPI2_W9_REG,             0x600810BC
.equ SPI2_W10_REG,            0x600810C0
.equ SPI2_W11_REG,            0x600810C4
.equ SPI2_W12_REG,            0x600810C8
.equ SPI2_W13_REG,            0x600810CC
.equ SPI2_W14_REG,            0x600810D0
.equ SPI2_W15_REG,            0x600810D4
# Version register
.equ SPI2_DATE_REG,           0x600810F0
######################################################

######################################################
# I2C Controller (I2C)
# (TRM 865)
######################################################
.equ I2C_BASE,                     0x60004000
# Timing Registers
.equ I2C_SCL_LOW_PERIOD_REG,       0x60004000
.equ I2C_SDA_HOLD_REG,             0x60004030
.equ I2C_SDA_SAMPLE_REG,           0x60004034
.equ I2C_SCL_HIGH_PERIOD_REG,      0x60004038
.equ I2C_SCL_START_HOLD_REG,       0x60004040
.equ I2C_SCL_RSTART_SETUP_REG,     0x60004044
.equ I2C_SCL_STOP_HOLD_REG,        0x60004048
.equ I2C_SCL_STOP_SETUP_REG,       0x6000404C
.equ I2C_SCL_ST_TIME_OUT_REG,      0x60004078
.equ I2C_SCL_MAIN_ST_TIME_OUT_REG, 0x6000407C
# Configuration Registers
.equ I2C_CTR_REG,                  0x60004004
.equ I2C_TO_REG,                   0x6000400C
.equ I2C_SLAVE_ADDR_REG,           0x60004010
.equ I2C_FIFO_CONF_REG,            0x60004018
.equ I2C_FILTER_CFG_REG,           0x60004050
.equ I2C_SCL_SP_CONF_REG,          0x60004080
.equ I2C_SCL_STRETCH_CONF_REG,     0x60004084
# Status Registers
.equ I2C_SR_REG,                   0x60004008
.equ I2C_FIFO_ST_REG,              0x60004014
.equ I2C_DATA_REG,                 0x6000401C
# Interrupt Registers
.equ I2C_INT_RAW_REG,              0x60004020
.equ I2C_INT_CLR_REG,              0x60004024
.equ I2C_INT_ENA_REG,              0x60004028
.equ I2C_INT_STATUS_REG,           0x6000402C
# Command Registers
.equ I2C_COMD0_REG,                0x60004058
.equ I2C_COMD1_REG,                0x6000405C
.equ I2C_COMD2_REG,                0x60004060
.equ I2C_COMD3_REG,                0x60004064
.equ I2C_COMD4_REG,                0x60004068
.equ I2C_COMD5_REG,                0x6000406C
.equ I2C_COMD6_REG,                0x60004070
.equ I2C_COMD7_REG,                0x60004074
# Version Register
.equ I2C_DATE_REG,                 0x600040F8
# Address Registers
.equ I2C_TXFIFO_START_ADDR_REG,    0x60004100
.equ I2C_RXFIFO_START_ADDR_REG,    0x60004180
######################################################

######################################################
# I2S Controller (I2S)
# (TRM 945)
######################################################
.equ I2S_BASE,                     0x6000C000
# Interrupt registers
.equ I2S_INT_RAW_REG,              0x6000C00C
.equ I2S_INT_ST_REG,               0x6000C010
.equ I2S_INT_ENA_REG,              0x6000C014
.equ I2S_INT_CLR_REG,              0x6000C018
# RX control and configuration registers
.equ I2S_RX_CONF_REG,              0x6000C020
.equ I2S_RX_CONF1_REG,             0x6000C028
.equ I2S_TX_PCM2PDM_CONF_REG,      0x6000C040
.equ I2S_TX_PCM2PDM_CONF1_REG,     0x6000C044
.equ I2S_RX_TDM_CTRL_REG,          0x6000C050
.equ I2S_RXEOF_NUM_REG,            0x6000C064
# TX control and configuration registers
.equ I2S_TX_CONF_REG,              0x6000C024
.equ I2S_TX_CONF1_REG,             0x6000C02C
.equ I2S_TX_TDM_CTRL_REG,          0x6000C054
# RX clock and timing registers
.equ I2S_RX_TIMING_REG,            0x6000C058
# TX clock and timing registers
.equ I2S_TX_TIMING_REG,            0x6000C05C
# Control and configuration registers
.equ I2S_LC_HUNG_CONF_REG,         0x6000C060
.equ I2S_CONF_SIGLE_DATA_REG,      0x6000C068
# TX Status Register
.equ I2S_STATE_REG,                0x6000C06C
# ETM Register
.equ I2S_ETM_CONF_REG,             0x6000C070
# Version Register
.equ I2S_DATE_REG,                 0x6000C080
######################################################

