codeljo/riscv-bare-metal/esp32c6/include/registers.inc
######################################################
# Pulse Count Controller (PCNT)
# (TRM 985)
######################################################
.equ PCNT_BASE,           0x60012000
# Configuration Register
.equ PCNT_U0_CONF0_REG,   0x60012000
.equ PCNT_U0_CONF1_REG,   0x60012004
.equ PCNT_U0_CONF2_REG,   0x60012008
.equ PCNT_U1_CONF0_REG,   0x6001200C
.equ PCNT_U1_CONF1_REG,   0x60012010
.equ PCNT_U1_CONF2_REG,   0x60012014
.equ PCNT_U2_CONF0_REG,   0x60012018
.equ PCNT_U2_CONF1_REG,   0x6001201C
.equ PCNT_U2_CONF2_REG,   0x60012020
.equ PCNT_U3_CONF0_REG,   0x60012024
.equ PCNT_U3_CONF1_REG,   0x60012028
.equ PCNT_U3_CONF2_REG,   0x6001202C
.equ PCNT_CTRL_REG,       0x60012060
# Status Register
.equ PCNT_U0_CNT_REG,     0x60012030
.equ PCNT_U1_CNT_REG,     0x60012034
.equ PCNT_U2_CNT_REG,     0x60012038
.equ PCNT_U3_CNT_REG,     0x6001203C
.equ PCNT_U0_STATUS_REG,  0x60012050
.equ PCNT_U1_STATUS_REG,  0x60012054
.equ PCNT_U2_STATUS_REG,  0x60012058
.equ PCNT_U3_STATUS_REG,  0x6001205C
# Interrupt Register
.equ PCNT_INT_RAW_REG,    0x60012040
.equ PCNT_INT_ST_REG,     0x60012044
.equ PCNT_INT_ENA_REG,    0x60012048
.equ PCNT_INT_CLR_REG,    0x6001204C
# Version Register
.equ PCNT_DATE_REG,       0x600120FC
######################################################

######################################################
# USB Serial/JTAG Controller (USB_SERIAL_JTAG)
# (TRM 1010)
######################################################
.equ USB_SERIAL_JTAG_BASE,                  0x6000F000
# Configuration Registers
.equ USB_SERIAL_JTAG_EP1_REG,               0x6000F000
.equ USB_SERIAL_JTAG_EP1_CONF_REG,          0x6000F004
.equ USB_SERIAL_JTAG_CONF0_REG,             0x6000F018
.equ USB_SERIAL_JTAG_TEST_REG,              0x6000F01C
.equ USB_SERIAL_JTAG_MISC_CONF_REG,         0x6000F044
.equ USB_SERIAL_JTAG_MEM_CONF_REG,          0x6000F048
.equ USB_SERIAL_JTAG_CHIP_RST_REG,          0x6000F04C
.equ USB_SERIAL_JTAG_GET_LINE_CODE_W0_REG,  0x6000F058
.equ USB_SERIAL_JTAG_GET_LINE_CODE_W1_REG,  0x6000F05C
.equ USB_SERIAL_JTAG_CONFIG_UPDATE_REG,     0x6000F060
.equ USB_SERIAL_JTAG_SER_AFIFO_CONFIG_REG,  0x6000F064
# Interrupt Registers
.equ USB_SERIAL_JTAG_INT_RAW_REG,           0x6000F008
.equ USB_SERIAL_JTAG_INT_ST_REG,            0x6000F00C
.equ USB_SERIAL_JTAG_INT_ENA_REG,           0x6000F010
.equ USB_SERIAL_JTAG_INT_CLR_REG,           0x6000F014
# Status Registers
.equ USB_SERIAL_JTAG_JFIFO_ST_REG,          0x6000F020
.equ USB_SERIAL_JTAG_FRAM_NUM_REG,          0x6000F024
.equ USB_SERIAL_JTAG_IN_EP0_ST_REG,         0x6000F028
.equ USB_SERIAL_JTAG_IN_EP1_ST_REG,         0x6000F02C
.equ USB_SERIAL_JTAG_IN_EP2_ST_REG,         0x6000F030
.equ USB_SERIAL_JTAG_IN_EP3_ST_REG,         0x6000F034
.equ USB_SERIAL_JTAG_OUT_EP0_ST_REG,        0x6000F038
.equ USB_SERIAL_JTAG_OUT_EP1_ST_REG,        0x6000F03C
.equ USB_SERIAL_JTAG_OUT_EP2_ST_REG,        0x6000F040
.equ USB_SERIAL_JTAG_SET_LINE_CODE_W0_REG,  0x6000F050
.equ USB_SERIAL_JTAG_SET_LINE_CODE_W1_REG,  0x6000F054
.equ USB_SERIAL_JTAG_BUS_RESET_ST_REG,      0x6000F068
# Version Registers
.equ USB_SERIAL_JTAG_DATE_REG,              0x6000F080
######################################################

######################################################
# Two-wire Automotive Interface (TWAI)
# (TRM 1036)
######################################################
.equ TWAI_BASE,                        0x6000B000
# Configuration Registers
.equ TWAI_MODE_REG,                    0x6000B000
.equ TWAI_BUS_TIMING_0_REG,            0x6000B018
.equ TWAI_BUS_TIMING_1_REG,            0x6000B01C
.equ TWAI_ERR_WARNING_LIMIT_REG,       0x6000B034
.equ TWAI_DATA_0_REG,                  0x6000B040
.equ TWAI_DATA_1_REG,                  0x6000B044
.equ TWAI_DATA_2_REG,                  0x6000B048
.equ TWAI_DATA_3_REG,                  0x6000B04C
.equ TWAI_DATA_4_REG,                  0x6000B050
.equ TWAI_DATA_5_REG,                  0x6000B054
.equ TWAI_DATA_6_REG,                  0x6000B058
.equ TWAI_DATA_7_REG,                  0x6000B05C
.equ TWAI_DATA_8_REG,                  0x6000B060
.equ TWAI_DATA_9_REG,                  0x6000B064
.equ TWAI_DATA_10_REG,                 0x6000B068
.equ TWAI_DATA_11_REG,                 0x6000B06C
.equ TWAI_DATA_12_REG,                 0x6000B070
.equ TWAI_CLOCK_DIVIDER_REG,           0x6000B07C
.equ TWAI_SW_STANDBY_CFG_REG,          0x6000B080
.equ TWAI_HW_CFG_REG,                  0x6000B084
.equ TWAI_HW_STANDBY_CNT_REG,          0x6000B088
.equ TWAI_IDLE_INTR_CNT_REG,           0x6000B08C
# Control Registers
.equ TWAI_CMD_REG,                     0x6000B004
# Status Register
.equ TWAI_STATUS_REG,                  0x6000B008
.equ TWAI_ARB_LOST_CAP_REG,            0x6000B02C
.equ TWAI_ERR_CODE_CAP_REG,            0x6000B030
.equ TWAI_RX_ERR_CNT_REG,              0x6000B038
.equ TWAI_TX_ERR_CNT_REG,              0x6000B03C
.equ TWAI_RX_MESSAGE_CNT_REG,          0x6000B074
# Interrupt Registers
.equ TWAI_INT_RAW_REG,                 0x6000B00C
.equ TWAI_INT_ENA_REG,                 0x6000B010
######################################################

######################################################
# SDIO 2.0 Controller (SDIO)
# (TRM 1078)
######################################################
.equ SDIO_HINF_BASE,                   0x60016000
.equ SDIO_SLC_BASE,                    0x60017000
.equ SDIO_SLCHOST_BASE,                0x60018000

.equ HINF_CFG_DATA0_REG,               0x60016000
.equ HINF_CFG_DATA1_REG,               0x60016004
.equ HINF_CFG_DATA7_REG,               0x6001601C
.equ HINF_CIS_CONF_W0_REG,             0x60016020
.equ HINF_CIS_CONF_W1_REG,             0x60016024
.equ HINF_CIS_CONF_W2_REG,             0x60016028
.equ HINF_CIS_CONF_W3_REG,             0x6001602C
.equ HINF_CIS_CONF_W4_REG,             0x60016030
.equ HINF_CIS_CONF_W5_REG,             0x60016034
.equ HINF_CIS_CONF_W6_REG,             0x60016038
.equ HINF_CIS_CONF_W7_REG,             0x6001603C
.equ HINF_CFG_DATA16_REG,              0x60016040
.equ HINF_CONF_STATUS_REG,             0x60016054

.equ SDIO_SLCCONF0_REG,                0x60017000
.equ SDIO_SLC0RX_LINK_REG,             0x6001703C
.equ SDIO_SLC0RX_LINK_ADDR_REG,        0x60017040
.equ SDIO_SLC0TX_LINK_REG,             0x60017044
.equ SDIO_SLC0TX_LINK_ADDR_REG,        0x60017048
.equ SDIO_SLC1RX_LINK_REG,             0x6001704C
.equ SDIO_SLC1RX_LINK_ADDR_REG,        0x60017050
.equ SDIO_SLC1TX_LINK_REG,             0x60017054
.equ SDIO_SLC1TX_LINK_ADDR_REG,        0x60017058
.equ SDIO_SLC0TOKEN1_REG,              0x60017064
.equ SDIO_SLC1TOKEN1_REG,              0x6001706C
.equ SDIO_SLCCONF1_REG,                0x60017070
.equ SDIO_SLC_RX_DSCR_CONF_REG,        0x600170A8
.equ SDIO_SLC0_LEN_CONF_REG,           0x600170F4
.equ SDIO_SLC0_TX_SHAREMEM_START_REG,  0x60017154
.equ SDIO_SLC0_TX_SHAREMEM_END_REG,    0x60017158
.equ SDIO_SLC0_RX_SHAREMEM_START_REG,  0x6001715C
.equ SDIO_SLC0_RX_SHAREMEM_END_REG,    0x60017160
.equ SDIO_SLC1_TX_SHAREMEM_START_REG,  0x60017164
.equ SDIO_SLC1_TX_SHAREMEM_END_REG,    0x60017168
.equ SDIO_SLC1_RX_SHAREMEM_START_REG,  0x6001716C
.equ SDIO_SLC1_RX_SHAREMEM_END_REG,    0x60017170
.equ SDIO_SLC_BURST_LEN_REG,           0x6001717C

