codeljo/riscv-bare-metal/esp32c6/include/registers.inc
.equ SDIO_SLC0INT_RAW_REG,             0x60017004
.equ SDIO_SLC0INT_ST_REG,              0x60017008
.equ SDIO_SLC0INT_ENA_REG,             0x6001700C
.equ SDIO_SLC0INT_CLR_REG,             0x60017010
.equ SDIO_SLC1INT_RAW_REG,             0x60017014
.equ SDIO_SLC1INT_CLR_REG,             0x60017020
.equ SDIO_SLCINTVEC_TOHOST_REG,        0x6001705C
.equ SDIO_SLC1INT_ST1_REG,             0x6001714C
.equ SDIO_SLC1INT_ENA1_REG,            0x60017150
.equ SDIO_SLC0_LENGTH_REG,             0x600170F8

.equ SLCHOST_CONF_REG,                 0x600181F0
.equ SLCHOST_SLC0HOST_INT_RAW_REG,     0x60018050
.equ SLCHOST_SLC1HOST_INT_RAW_REG,     0x60018054
.equ SLCHOST_SLC0HOST_INT_ST_REG,      0x60018058
.equ SLCHOST_SLC1HOST_INT_ST_REG,      0x6001805C
.equ SLCHOST_CONF_W7_REG,              0x6001808C
.equ SLCHOST_SLC0HOST_INT_CLR_REG,     0x600180D4
.equ SLCHOST_SLC1HOST_INT_CLR_REG,     0x600180D8
.equ SLCHOST_SLC0HOST_FUNC1_INT_ENA_REG, 0x600180DC
.equ SLCHOST_SLC1HOST_FUNC1_INT_ENA_REG, 0x600180E0

.equ SLCHOST_SLC0HOST_TOKEN_RDATA_REG, 0x60018044
.equ SLCHOST_PKT_LEN_REG,              0x60018060
.equ SLCHOST_SLC1HOST_TOKEN_RDATA_REG, 0x600180C4

.equ SLCHOST_CONF_W0_REG,              0x6001806C
.equ SLCHOST_CONF_W1_REG,              0x60018070
.equ SLCHOST_CONF_W2_REG,              0x60018074
.equ SLCHOST_CONF_W3_REG,              0x60018078
.equ SLCHOST_CONF_W4_REG,              0x6001807C
.equ SLCHOST_CONF_W6_REG,              0x60018088

.equ SLCHOST_CONF_W8_REG,              0x6001809C
.equ SLCHOST_CONF_W9_REG,              0x60018100
.equ SLCHOST_CONF_W10_REG,             0x60018104
.equ SLCHOST_CONF_W11_REG,             0x60018108
.equ SLCHOST_CONF_W12_REG,             0x6001810C
.equ SLCHOST_CONF_W13_REG,             0x60018110
.equ SLCHOST_CONF_W14_REG,             0x60018114
.equ SLCHOST_CONF_W15_REG,             0x60018118
######################################################

######################################################
# LED PWM Controller (LEDC)
# (TRM 1134)
######################################################
.equ LEDC_BASE,                        0x60007000
# Configuration Register
.equ LEDC_CH0_CONF0_REG,               0x60007000
.equ LEDC_CH0_CONF1_REG,               0x6000700C
.equ LEDC_CH1_CONF0_REG,               0x60007014
.equ LEDC_CH1_CONF1_REG,               0x60007020
.equ LEDC_CH2_CONF0_REG,               0x60007028
.equ LEDC_CH2_CONF1_REG,               0x60007034
.equ LEDC_CH3_CONF0_REG,               0x6000703C
.equ LEDC_CH3_CONF1_REG,               0x60007048
.equ LEDC_CH4_CONF0_REG,               0x60007050
.equ LEDC_CH4_CONF1_REG,               0x6000705C
.equ LEDC_CH5_CONF0_REG,               0x60007064
.equ LEDC_CH5_CONF1_REG,               0x60007070
.equ LEDC_EVT_TASK_EN0_REG,            0x600071A0
.equ LEDC_EVT_TASK_EN1_REG,            0x600071A4
.equ LEDC_EVT_TASK_EN2_REG,            0x600071A8
.equ LEDC_TIMER0_CMP_REG,              0x600071B0
.equ LEDC_TIMER1_CMP_REG,              0x600071B4
.equ LEDC_TIMER2_CMP_REG,              0x600071B8
.equ LEDC_TIMER3_CMP_REG,              0x600071BC
.equ LEDC_TIMER0_CNT_CAP_REG,          0x600071C0
.equ LEDC_TIMER1_CNT_CAP_REG,          0x600071C4
.equ LEDC_TIMER2_CNT_CAP_REG,          0x600071C8
.equ LEDC_TIMER3_CNT_CAP_REG,          0x600071CC
.equ LEDC_CONF_REG,                    0x600071F0
# Hpoint Register
.equ LEDC_CH0_HPOINT_REG,              0x60007004
.equ LEDC_CH1_HPOINT_REG,              0x60007018
.equ LEDC_CH2_HPOINT_REG,              0x6000702C
.equ LEDC_CH3_HPOINT_REG,              0x60007040
.equ LEDC_CH4_HPOINT_REG,              0x60007054
.equ LEDC_CH5_HPOINT_REG,              0x60007068
# Duty Cycle Register
.equ LEDC_CH0_DUTY_REG,                0x60007008
.equ LEDC_CH0_DUTY_R_REG,              0x60007010
.equ LEDC_CH1_DUTY_REG,                0x6000701C
.equ LEDC_CH1_DUTY_R_REG,              0x60007024
.equ LEDC_CH2_DUTY_REG,                0x60007030
.equ LEDC_CH2_DUTY_R_REG,              0x60007038
.equ LEDC_CH3_DUTY_REG,                0x60007044
.equ LEDC_CH3_DUTY_R_REG,              0x6000704C
.equ LEDC_CH4_DUTY_REG,                0x60007058
.equ LEDC_CH4_DUTY_R_REG,              0x60007060
.equ LEDC_CH5_DUTY_REG,                0x6000706C
.equ LEDC_CH5_DUTY_R_REG,              0x60007074
# Timer Register
.equ LEDC_TIMER0_CONF_REG,             0x600070A0
.equ LEDC_TIMER0_VALUE_REG,            0x600070A4
.equ LEDC_TIMER1_CONF_REG,             0x600070A8
.equ LEDC_TIMER1_VALUE_REG,            0x600070AC
.equ LEDC_TIMER2_CONF_REG,             0x600070B0
.equ LEDC_TIMER2_VALUE_REG,            0x600070B4
.equ LEDC_TIMER3_CONF_REG,             0x600070B8
.equ LEDC_TIMER3_VALUE_REG,            0x600070BC
# Interrupt Register
.equ LEDC_INT_RAW_REG,                 0x600070C0
.equ LEDC_INT_ST_REG,                  0x600070C4
.equ LEDC_INT_ENA_REG,                 0x600070C8
.equ LEDC_INT_CLR_REG,                 0x600070CC
# Gamma RAM Register

# Gamma Configuration Register
.equ LEDC_CH0_GAMMA_CONF_REG,          0x60007180
.equ LEDC_CH1_GAMMA_CONF_REG,          0x60007184
.equ LEDC_CH2_GAMMA_CONF_REG,          0x60007188
.equ LEDC_CH3_GAMMA_CONF_REG,          0x6000718C
.equ LEDC_CH4_GAMMA_CONF_REG,          0x60007190
.equ LEDC_CH5_GAMMA_CONF_REG,          0x60007194
# Version Register
.equ LEDC_DATE_REG,                    0x600071FC
######################################################

######################################################
# Motor Control PWM (MCPWM)
# (TRM 1198)
######################################################
.equ MCPWM_BASE,                  0x60014000
.equ MCPWM_CLK_CFG_REG,           0x60014000
.equ MCPWM_TIMER0_CFG0_REG,       0x60014004
.equ MCPWM_TIMER0_CFG1_REG,       0x60014008
.equ MCPWM_TIMER0_SYNC_REG,       0x6001400C
.equ MCPWM_TIMER0_STATUS_REG,     0x60014010
.equ MCPWM_TIMER1_CFG0_REG,       0x60014014
.equ MCPWM_TIMER1_CFG1_REG,       0x60014018
.equ MCPWM_TIMER1_SYNC_REG,       0x6001401C
.equ MCPWM_TIMER1_STATUS_REG,     0x60014020
.equ MCPWM_TIMER2_CFG0_REG,       0x60014024
.equ MCPWM_TIMER2_CFG1_REG,       0x60014028
.equ MCPWM_TIMER2_SYNC_REG,       0x6001402C
.equ MCPWM_TIMER2_STATUS_REG,     0x60014030
.equ MCPWM_TIMER_SYNCI_CFG_REG,   0x60014034
.equ MCPWM_OPERATOR_TIMERSEL_REG, 0x60014038
.equ MCPWM_GEN0_STMP_CFG_REG,     0x6001403C
.equ MCPWM_GEN0_TSTMP_A_REG,      0x60014040
.equ MCPWM_GEN0_TSTMP_B_REG,      0x60014044
.equ MCPWM_GEN0_CFG0_REG,         0x60014048
.equ MCPWM_GEN0_FORCE_REG,        0x6001404C
.equ MCPWM_GEN0_A_REG,            0x60014050
.equ MCPWM_GEN0_B_REG,            0x60014054
.equ MCPWM_DT0_CFG_REG,           0x60014058
.equ MCPWM_DT0_FED_CFG_REG,       0x6001405C
.equ MCPWM_DT0_RED_CFG_REG,       0x60014060
.equ MCPWM_CARRIER0_CFG_REG,      0x60014064
.equ MCPWM_FH0_CFG0_REG,          0x60014068
.equ MCPWM_FH0_CFG1_REG,          0x6001406C
.equ MCPWM_FH0_STATUS_REG,        0x60014070
.equ MCPWM_GEN1_STMP_CFG_REG,     0x60014074
.equ MCPWM_GEN1_TSTMP_A_REG,      0x60014078
.equ MCPWM_GEN1_TSTMP_B_REG,      0x6001407C
.equ MCPWM_GEN1_CFG0_REG,         0x60014080
.equ MCPWM_GEN1_FORCE_REG,        0x60014084
.equ MCPWM_GEN1_A_REG,            0x60014088
.equ MCPWM_GEN1_B_REG,            0x6001408C
.equ MCPWM_DT1_CFG_REG,           0x60014090
.equ MCPWM_DT1_FED_CFG_REG,       0x60014094
.equ MCPWM_DT1_RED_CFG_REG,       0x60014098
.equ MCPWM_CARRIER1_CFG_REG,      0x6001409C
.equ MCPWM_FH1_CFG0_REG,          0x600140A0
.equ MCPWM_FH1_CFG1_REG,          0x600140A4
.equ MCPWM_FH1_STATUS_REG,        0x600140A8
.equ MCPWM_GEN2_STMP_CFG_REG,     0x600140AC
.equ MCPWM_GEN2_TSTMP_A_REG,      0x600140B0
.equ MCPWM_GEN2_TSTMP_B_REG,      0x600140B4
.equ MCPWM_GEN2_CFG0_REG,         0x600140B8
.equ MCPWM_GEN2_FORCE_REG,        0x600140BC
.equ MCPWM_GEN2_A_REG,            0x600140C0
.equ MCPWM_GEN2_B_REG,            0x600140C4
.equ MCPWM_DT2_CFG_REG,           0x600140C8
.equ MCPWM_DT2_FED_CFG_REG,       0x600140CC
.equ MCPWM_DT2_RED_CFG_REG,       0x600140D0
.equ MCPWM_CARRIER2_CFG_REG,      0x600140D4
.equ MCPWM_FH2_CFG0_REG,          0x600140D8
.equ MCPWM_FH2_CFG1_REG,          0x600140DC
.equ MCPWM_FH2_STATUS_REG,        0x600140E0
.equ MCPWM_FAULT_DETECT_REG,      0x600140E4
.equ MCPWM_CAP_TIMER_CFG_REG,     0x600140E8
.equ MCPWM_CAP_TIMER_PHASE_REG,   0x600140EC
.equ MCPWM_CAP_CH0_CFG_REG,       0x600140F0
.equ MCPWM_CAP_CH1_CFG_REG,       0x600140F4
.equ MCPWM_CAP_CH2_CFG_REG,       0x600140F8
.equ MCPWM_CAP_CH0_REG,           0x600140FC
.equ MCPWM_CAP_CH1_REG,           0x60014100
.equ MCPWM_CAP_CH2_REG,           0x60014104
.equ MCPWM_CAP_STATUS_REG,        0x60014108
.equ MCPWM_UPDATE_CFG_REG,        0x6001410C
.equ MCPWM_INT_ENA_REG,           0x60014110
.equ MCPWM_INT_RAW_REG,           0x60014114
.equ MCPWM_INT_ST_REG,            0x60014118
.equ MCPWM_INT_CLR_REG,           0x6001411C
.equ MCPWM_EVT_EN_REG,            0x60014120
.equ MCPWM_TASK_EN_REG,           0x60014124
.equ MCPWM_CLK_REG,               0x60014128
.equ MCPWM_VERSION_REG,           0x6001412C
######################################################

######################################################
# Remote Control Peripheral (RMT)
# (TRM 1274)
######################################################
.equ RMT_BASE,                    0x60006000
# FIFO R/W Registers
.equ RMT_CH0DATA_REG,             0x60006000
.equ RMT_CH1DATA_REG,             0x60006004
.equ RMT_CH2DATA_REG,             0x60006008
.equ RMT_CH3DATA_REG,             0x6000600C
# Configuration Registers
.equ RMT_CH0CONF0_REG,            0x60006010
.equ RMT_CH1CONF0_REG,            0x60006014
.equ RMT_CH2CONF0_REG,            0x60006018
.equ RMT_CH2CONF1_REG,            0x6000601C
.equ RMT_CH3CONF0_REG,            0x60006020
.equ RMT_CH3CONF1_REG,            0x60006024
.equ RMT_SYS_CONF_REG,            0x60006068
.equ RMT_REF_CNT_RST_REG,         0x60006070
# Status Registers
.equ RMT_CH0STATUS_REG,           0x60006028
.equ RMT_CH1STATUS_REG,           0x6000602C
.equ RMT_CH2STATUS_REG,           0x60006030
.equ RMT_CH3STATUS_REG,           0x60006034
# Interrupt Registers
.equ RMT_INT_RAW_REG,             0x60006038
.equ RMT_INT_ST_REG,              0x6000603C
.equ RMT_INT_ENA_REG,             0x60006040
.equ RMT_INT_CLR_REG,             0x60006044
# Carrier Wave Duty Cycle Registers
.equ RMT_CH0CARRIER_DUTY_REG,     0x60006048
.equ RMT_CH1CARRIER_DUTY_REG,     0x6000604C
.equ RMT_CH2_RX_CARRIER_RM_REG,   0x60006050
.equ RMT_CH3_RX_CARRIER_RM_REG,   0x60006054
# TX Event Configuration Registers
.equ RMT_CH0_TX_LIM_REG,          0x60006058
.equ RMT_CH1_TX_LIM_REG,          0x6000605C
.equ RMT_TX_SIM_REG,              0x6000606C
# RX Event Configuration Registers
.equ RMT_CH2_RX_LIM_REG,          0x60006060
.equ RMT_CH3_RX_LIM_REG,          0x60006064
# Version Register
.equ RMT_DATE_REG,                0x600060CC
######################################################

######################################################
# Parallel IO Controller (PARL_IO)
# (TRM 1299)
######################################################
.equ PARL_IO_BASE,                0x60015000
.equ PARL_IO_RX_CFG0_REG,         0x60015000
.equ PARL_IO_RX_CFG1_REG,         0x60015004
.equ PARL_IO_TX_CFG0_REG,         0x60015008
.equ PARL_IO_TX_CFG1_REG,         0x6001500C
.equ PARL_IO_ST_REG,              0x60015010
.equ PARL_IO_INT_ENA_REG,         0x60015014
.equ PARL_IO_INT_RAW_REG,         0x60015018
.equ PARL_IO_INT_ST_REG,          0x6001501C
.equ PARL_IO_INT_CLR_REG,         0x60015020
.equ PARL_IO_CLK_REG,             0x60015120
.equ PARL_IO_VERSION_REG,         0x600153FC
######################################################

######################################################
# SAR ADC (APB_SARADC)
# (TRM 1323)
######################################################
.equ ADC_BASE,                         0x6000E000
# Configuration Registers
.equ APB_SARADC_CTRL_REG,              0x6000E000
.equ APB_SARADC_CTRL2_REG,             0x6000E004
.equ APB_SARADC_FILTER_CTRL1_REG,      0x6000E008
.equ APB_SARADC_SAR_PATT_TAB1_REG,     0x6000E018
.equ APB_SARADC_SAR_PATT_TAB2_REG,     0x6000E01C
.equ APB_SARADC_ONETIME_SAMPLE_REG,    0x6000E020
.equ APB_SARADC_FILTER_CTRL0_REG,      0x6000E028
.equ APB_SARADC_SAR1DATA_STATUS_REG,   0x6000E02C
.equ APB_SARADC_THRES0_CTRL_REG,       0x6000E034
.equ APB_SARADC_THRES1_CTRL_REG,       0x6000E038
.equ APB_SARADC_THRES_CTRL_REG,        0x6000E03C
.equ APB_SARADC_INT_ENA_REG,           0x6000E040
.equ APB_SARADC_INT_RAW_REG,           0x6000E044
.equ APB_SARADC_INT_ST_REG,            0x6000E048
.equ APB_SARADC_INT_CLR_REG,           0x6000E04C
.equ APB_SARADC_DMA_CONF_REG,          0x6000E050
.equ APB_SARADC_APB_TSENS_CTRL_REG,    0x6000E058
.equ APB_SARADC_APB_TSENS_CTRL2_REG,   0x6000E05C
.equ APB_SARADC_CALI_REG,              0x6000E060
.equ APB_TSENS_WAKE_REG,               0x6000E064
.equ APB_TSENS_SAMPLE_REG,             0x6000E068
.equ APB_SARADC_CTRL_DATE_REG,         0x6000E3FC
######################################################